ir_version: 3
producer_name: "OpenVINO ONNX Frontend"
model_version: 1
graph {
  node {
    name: "multiplication"
    input: "A"
    input: "B"
    output: "mul_out"
    op_type: "Mul"
  }
  node {
    name: "addition"
    input: "mul_out"
    input: "C"
    output: "add_out"
    op_type: "Add"
  }
  input {
    name: "A"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "B"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "C"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "add_out"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  name: "simple_dyn_shapes_graph"
}
opset_import {
  domain: ""
  version: 7
}
