ir_version: 3
producer_name: "OpenVINO ONNX Frontend"
model_version: 1
graph {
  node {
    name: "dyn_conv"
    input: "data"
    input: "filters"
    input: "bias"
    output: "dyn_conv_out"
    op_type: "Conv"
  }
  input {
    name: "data"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 7
          }
          dim {
            dim_value: 7
          }
        }
      }
    }
  }
  input {
    name: "filters"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "bias"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 10
          }
        }
      }
    }
  }
  output {
    name: "dyn_conv_out"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_param: "batch"
          }
          dim {
            dim_value: 10
          }
          dim {
            dim_value: 6
          }
          dim {
            dim_value: 6
          }
        }
      }
    }
  }
  name: "simple_dyn_shapes_graph"
}
opset_import {
  domain: ""
  version: 7
}
