ir_version: 3
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "x"
    output: "y"
    op_type: "EyeLike"
      attribute {
      name: "k"
      i: -1
      type: INT
    }
  }
  name: "test_graph"
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
          }
          dim {
          }
        }
      }
    }
  }
  output {
    name: "y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
          }
          dim {
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
