ir_version: 5
producer_name: "nGraph ONNX Importer"
graph {
  node {
    input: "x"
    input: "w"
    input: "x_zero_point"
    output: "y"
    name: "node1"
    op_type: "ConvInteger"
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    doc_string: "ConvInteger"
    domain: ""
  }
  name: "test"
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 2
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "w"
    type {
      tensor_type {
        elem_type: 2
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "x_zero_point"
    type {
      tensor_type {
        elem_type: 2
        shape {
        }
      }
    }
  }
  output {
    name: "y"
    type {
      tensor_type {
        elem_type: 6
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 10
}
