ir_version: 3
producer_name: "nGraph ONNX Importer"
graph {
  node {
    output: "random"
    op_type: "RandomUniform"
    attribute {
      name: "dtype"
      i: 1
      type: INT
    }
    attribute {
      name: "low"
      f: 2
      type: FLOAT
    }
    attribute {
      name: "high"
      f: 5
      type: FLOAT
    }
    attribute {
      name: "seed"
      f: 5555
      type: FLOAT
    }
    attribute {
      name: "shape"
      ints: 1
      ints: 3
      ints: 100
      ints: 100
      type: INTS
    }
  }
  name: "test_graph"
  output {
    name: "random"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 100
          }
          dim {
            dim_value: 100
          }
        }
      }
    }
  }
}
opset_import {
  version: 1
}
