ir_version: 6
producer_name: "backend-test"
graph {
  node {
    output: "min"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        dims: 1
        float_data: 0.0001
        name: "min_tensor"
      }
      type: TENSOR
    }
  }
  node {
    input: "x"
    input: "min"
    input: ""
    output: "y"
    op_type: "Clip"
  }
  name: "test_clip_default_inbounds"
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  output {
    name: "y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
}
opset_import {
  version: 12
}
