<?xml version="1.0"?>
<net name="Model238885" version="10">
	<layers>
		<layer id="0" name="Parameter_149902374" type="Parameter" version="opset1">
			<data shape="1,8,32,16" element_type="f32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>32</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_149904487" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Transpose_149904488" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>32</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>16</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Transpose_149904489" type="Const" version="opset1">
			<data element_type="f32" shape="8, 1, 1, 8" offset="32" size="256" />
			<output>
				<port id="0" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="GNAConvolution_149904490" type="GNAConvolution" version="intel_gna">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>16</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>8</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>16</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Constant_149904511" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="0" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Transpose_149904512" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>32</dim>
					<dim>16</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>16</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Transpose_149904514" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>16</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>16</dim>
					<dim>8</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>16</dim>
					<dim>8</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_149904513" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="288" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Add_149902377" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>16</dim>
					<dim>8</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>32</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Result_149902378" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>8</dim>
					<dim>32</dim>
					<dim>16</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="0" from-port="0" to-layer="6" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="2" to-port="1" />
		<edge from-layer="2" from-port="2" to-layer="4" to-port="0" />
		<edge from-layer="3" from-port="0" to-layer="4" to-port="1" />
		<edge from-layer="4" from-port="2" to-layer="7" to-port="0" />
		<edge from-layer="5" from-port="0" to-layer="6" to-port="1" />
		<edge from-layer="6" from-port="2" to-layer="7" to-port="1" />
		<edge from-layer="7" from-port="2" to-layer="9" to-port="0" />
		<edge from-layer="8" from-port="0" to-layer="9" to-port="1" />
		<edge from-layer="9" from-port="2" to-layer="10" to-port="0" />
	</edges>
	<rt_info />
</net>
