<?xml version="1.0"?>
<net name="Function_0" version="10">
	<layers>
		<layer id="0" name="read_file_0.tmp_0" type="Input">
			<data shape="1, 3, 224, 224" element_type="f32" execOrder="251" execTimeMcs="not_executed" originalLayersNames="read_file_0.tmp_0" outputLayouts="abcd" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_1132" type="Const">
			<data execOrder="250" execTimeMcs="not_executed" originalLayersNames="Constant_1132" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Constant_1133" type="Const">
			<data execOrder="249" execTimeMcs="not_executed" originalLayersNames="Constant_1133" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Constant_11026" type="Const">
			<data execOrder="248" execTimeMcs="not_executed" originalLayersNames="Constant_11026" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_11027" type="Const">
			<data execOrder="247" execTimeMcs="not_executed" originalLayersNames="Constant_11027" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="FakeQuantize_1136" type="FakeQuantize">
			<data execOrder="252" execTimeMcs="not_executed" originalLayersNames="FakeQuantize_1136" outputLayouts="abcd" outputPrecisions="U8" primitiveType="jit_avx2_FP32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="U8">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="FakeQuantize_1136_abcd_acdb_Multiply_9153" type="Reorder">
			<data execOrder="253" execTimeMcs="not_executed" originalLayersNames="" outputLayouts="acdb" outputPrecisions="U8" primitiveType="jit_uni_I8" runtimePrecision="U8" />
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="U8">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_1488" type="Const">
			<data execOrder="245" execTimeMcs="not_executed" originalLayersNames="Constant_1488" outputLayouts="abcd" outputPrecisions="I8" primitiveType="unknown_I8" runtimePrecision="I8" />
			<output>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_1488_abcd_ABcd2b8a4b_Multiply_9153" type="Reorder">
			<data execOrder="246" execTimeMcs="not_executed" originalLayersNames="" outputLayouts="ABcd2b8a4b" outputPrecisions="I8" primitiveType="ref_any_I8" runtimePrecision="I8" />
			<input>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I8">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_11063" type="Const">
			<data execOrder="244" execTimeMcs="not_executed" originalLayersNames="Constant_11063" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Multiply_9153" type="Convolution">
			<data execOrder="254" execTimeMcs="not_executed" originalLayersNames="Multiply_9153,conv1_1_bn_mean,Multiply_11059,relu6_0.tmp_0,FakeQuantize_1142" outputLayouts="acdb" outputPrecisions="U8" primitiveType="jit_avx2_I8" runtimePrecision="U8" />
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>3</dim>
					<dim>224</dim>
					<dim>224</dim>
				</port>
				<port id="1" precision="I8">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="U8">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_1493" type="Const">
			<data execOrder="242" execTimeMcs="not_executed" originalLayersNames="Constant_1493" outputLayouts="abcd" outputPrecisions="I8" primitiveType="unknown_I8" runtimePrecision="I8" />
			<output>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_1493_abcd_ABcd2b8a4b_Multiply_9160" type="Reorder">
			<data execOrder="243" execTimeMcs="not_executed" originalLayersNames="" outputLayouts="ABcd2b8a4b" outputPrecisions="I8" primitiveType="jit_uni_I8" runtimePrecision="I8" />
			<input>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I8">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Constant_11107" type="Const">
			<data execOrder="241" execTimeMcs="not_executed" originalLayersNames="Constant_11107" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Multiply_9160" type="Convolution">
			<data execOrder="255" execTimeMcs="not_executed" originalLayersNames="Multiply_9160,conv2_1_expand_bn_mean,Multiply_11103,relu6_1.tmp_0,FakeQuantize_1148" outputLayouts="acdb" outputPrecisions="U8" primitiveType="jit_avx2_1x1_I8" runtimePrecision="U8" />
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="I8">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="U8">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_11154" type="Const">
			<data execOrder="239" execTimeMcs="not_executed" originalLayersNames="Constant_11154" outputLayouts="abcde" outputPrecisions="I8" primitiveType="unknown_I8" runtimePrecision="I8" />
			<output>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Constant_11154_abcde_Abcde8a_Multiply_9167" type="Reorder">
			<data execOrder="240" execTimeMcs="not_executed" originalLayersNames="" outputLayouts="Abcde8a" outputPrecisions="I8" primitiveType="jit_uni_I8" runtimePrecision="I8" />
			<input>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I8">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_11161" type="Const">
			<data execOrder="238" execTimeMcs="not_executed" originalLayersNames="Constant_11161" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Multiply_9167" type="Convolution">
			<data execOrder="256" execTimeMcs="not_executed" originalLayersNames="Multiply_9167,conv2_1_dwise_bn_mean,Multiply_11157,relu6_2.tmp_0,FakeQuantize_1154" outputLayouts="acdb" outputPrecisions="U8" primitiveType="jit_avx2_I8" runtimePrecision="U8" />
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="I8">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="U8">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_1507" type="Const">
			<data execOrder="236" execTimeMcs="not_executed" originalLayersNames="Constant_1507" outputLayouts="abcd" outputPrecisions="I8" primitiveType="unknown_I8" runtimePrecision="I8" />
			<output>
				<port id="0" precision="I8">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_1507_abcd_ABcd2b8a4b_Multiply_9174" type="Reorder">
			<data execOrder="237" execTimeMcs="not_executed" originalLayersNames="" outputLayouts="ABcd2b8a4b" outputPrecisions="I8" primitiveType="jit_uni_I8" runtimePrecision="I8" />
			<input>
				<port id="0" precision="I8">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I8">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Constant_11205" type="Const">
			<data execOrder="235" execTimeMcs="not_executed" originalLayersNames="Constant_11205" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Multiply_9174" type="Convolution">
			<data execOrder="257" execTimeMcs="not_executed" originalLayersNames="Multiply_9174,conv2_1_linear_bn_mean,FakeQuantize_1160" outputLayouts="acdb" outputPrecisions="U8" primitiveType="jit_avx2_1x1_I8" runtimePrecision="U8" />
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>32</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="I8">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="U8">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_1512" type="Const">
			<data execOrder="233" execTimeMcs="not_executed" originalLayersNames="Constant_1512" outputLayouts="abcd" outputPrecisions="I8" primitiveType="unknown_I8" runtimePrecision="I8" />
			<output>
				<port id="0" precision="I8">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_1512_abcd_ABcd2b8a4b_Multiply_9181" type="Reorder">
			<data execOrder="234" execTimeMcs="not_executed" originalLayersNames="" outputLayouts="ABcd2b8a4b" outputPrecisions="I8" primitiveType="jit_uni_I8" runtimePrecision="I8" />
			<input>
				<port id="0" precision="I8">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I8">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_11249" type="Const">
			<data execOrder="232" execTimeMcs="not_executed" originalLayersNames="Constant_11249" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Multiply_9181" type="Convolution">
			<data execOrder="258" execTimeMcs="not_executed" originalLayersNames="Multiply_9181,conv3_1_expand_bn_mean,Multiply_11245,relu6_3.tmp_0,FakeQuantize_1166" outputLayouts="acdb" outputPrecisions="U8" primitiveType="jit_avx2_1x1_I8" runtimePrecision="U8" />
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>16</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="I8">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="U8">
					<dim>1</dim>
					<dim>96</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_11296" type="Const">
			<data execOrder="230" execTimeMcs="not_executed" originalLayersNames="Constant_11296" outputLayouts="abcde" outputPrecisions="I8" primitiveType="unknown_I8" runtimePrecision="I8" />
			<output>
				<port id="0" precision="I8">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_11296_abcde_Abcde8a_Multiply_9188" type="Reorder">
			<data execOrder="231" execTimeMcs="not_executed" originalLayersNames="" outputLayouts="Abcde8a" outputPrecisions="I8" primitiveType="jit_uni_I8" runtimePrecision="I8" />
			<input>
				<port id="0" precision="I8">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I8">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_11303" type="Const">
			<data execOrder="229" execTimeMcs="not_executed" originalLayersNames="Constant_11303" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Multiply_9188" type="Convolution">
			<data execOrder="259" execTimeMcs="not_executed" originalLayersNames="Multiply_9188,conv3_1_dwise_bn_mean,Multiply_11299,relu6_4.tmp_0,FakeQuantize_1172" outputLayouts="acdb" outputPrecisions="U8" primitiveType="jit_avx2_I8" runtimePrecision="U8" />
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>96</dim>
					<dim>112</dim>
					<dim>112</dim>
				</port>
				<port id="1" precision="I8">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="U8">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_1526" type="Const">
			<data execOrder="227" execTimeMcs="not_executed" originalLayersNames="Constant_1526" outputLayouts="abcd" outputPrecisions="I8" primitiveType="unknown_I8" runtimePrecision="I8" />
			<output>
				<port id="0" precision="I8">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_1526_abcd_ABcd2b8a4b_Multiply_9195" type="Reorder">
			<data execOrder="228" execTimeMcs="not_executed" originalLayersNames="" outputLayouts="ABcd2b8a4b" outputPrecisions="I8" primitiveType="jit_uni_I8" runtimePrecision="I8" />
			<input>
				<port id="0" precision="I8">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I8">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_11347" type="Const">
			<data execOrder="226" execTimeMcs="not_executed" originalLayersNames="Constant_11347" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Multiply_9195" type="Convolution">
			<data execOrder="260" execTimeMcs="not_executed" originalLayersNames="Multiply_9195,conv3_1_linear_bn_mean,Multiply_11343" outputLayouts="acdb" outputPrecisions="FP32" primitiveType="jit_avx2_1x1_I8" runtimePrecision="U8" />
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>96</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="I8">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_1174" type="Const">
			<data execOrder="221" execTimeMcs="not_executed" originalLayersNames="Constant_1174" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_1175" type="Const">
			<data execOrder="220" execTimeMcs="not_executed" originalLayersNames="Constant_1175" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_11362" type="Const">
			<data execOrder="219" execTimeMcs="not_executed" originalLayersNames="Constant_11362" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Constant_11363" type="Const">
			<data execOrder="218" execTimeMcs="not_executed" originalLayersNames="Constant_11363" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="FakeQuantize_1178" type="FakeQuantize">
			<data execOrder="262" execTimeMcs="not_executed" originalLayersNames="FakeQuantize_1178" outputLayouts="acdb" outputPrecisions="U8" primitiveType="jit_avx2_FP32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="U8">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_1531" type="Const">
			<data execOrder="216" execTimeMcs="not_executed" originalLayersNames="Constant_1531" outputLayouts="abcd" outputPrecisions="I8" primitiveType="unknown_I8" runtimePrecision="I8" />
			<output>
				<port id="0" precision="I8">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_1531_abcd_ABcd2b8a4b_Multiply_9202" type="Reorder">
			<data execOrder="217" execTimeMcs="not_executed" originalLayersNames="" outputLayouts="ABcd2b8a4b" outputPrecisions="I8" primitiveType="jit_uni_I8" runtimePrecision="I8" />
			<input>
				<port id="0" precision="I8">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I8">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_11399" type="Const">
			<data execOrder="215" execTimeMcs="not_executed" originalLayersNames="Constant_11399" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Multiply_9202" type="Convolution">
			<data execOrder="263" execTimeMcs="not_executed" originalLayersNames="Multiply_9202,conv3_2_expand_bn_mean,Multiply_11395,relu6_5.tmp_0,FakeQuantize_1184" outputLayouts="acdb" outputPrecisions="U8" primitiveType="jit_avx2_1x1_I8" runtimePrecision="U8" />
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="I8">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="U8">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_11446" type="Const">
			<data execOrder="213" execTimeMcs="not_executed" originalLayersNames="Constant_11446" outputLayouts="abcde" outputPrecisions="I8" primitiveType="unknown_I8" runtimePrecision="I8" />
			<output>
				<port id="0" precision="I8">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_11446_abcde_Abcde8a_Multiply_9209" type="Reorder">
			<data execOrder="214" execTimeMcs="not_executed" originalLayersNames="" outputLayouts="Abcde8a" outputPrecisions="I8" primitiveType="jit_uni_I8" runtimePrecision="I8" />
			<input>
				<port id="0" precision="I8">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I8">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Constant_11453" type="Const">
			<data execOrder="212" execTimeMcs="not_executed" originalLayersNames="Constant_11453" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Multiply_9209" type="Convolution">
			<data execOrder="264" execTimeMcs="not_executed" originalLayersNames="Multiply_9209,conv3_2_dwise_bn_mean,Multiply_11449,relu6_6.tmp_0,FakeQuantize_1190" outputLayouts="acdb" outputPrecisions="U8" primitiveType="jit_avx2_I8" runtimePrecision="U8" />
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="I8">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="U8">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_1545" type="Const">
			<data execOrder="210" execTimeMcs="not_executed" originalLayersNames="Constant_1545" outputLayouts="abcd" outputPrecisions="I8" primitiveType="unknown_I8" runtimePrecision="I8" />
			<output>
				<port id="0" precision="I8">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_1545_abcd_ABcd2b8a4b_Multiply_9216" type="Reorder">
			<data execOrder="211" execTimeMcs="not_executed" originalLayersNames="" outputLayouts="ABcd2b8a4b" outputPrecisions="I8" primitiveType="jit_uni_I8" runtimePrecision="I8" />
			<input>
				<port id="0" precision="I8">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I8">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Constant_11497" type="Const">
			<data execOrder="209" execTimeMcs="not_executed" originalLayersNames="Constant_11497" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_1870" type="Const">
			<data execOrder="225" execTimeMcs="not_executed" originalLayersNames="Constant_1870" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_1871" type="Const">
			<data execOrder="224" execTimeMcs="not_executed" originalLayersNames="Constant_1871" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Constant_11353" type="Const">
			<data execOrder="223" execTimeMcs="not_executed" originalLayersNames="Constant_11353" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Constant_11354" type="Const">
			<data execOrder="222" execTimeMcs="not_executed" originalLayersNames="Constant_11354" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="FakeQuantize_1874" type="FakeQuantize">
			<data execOrder="261" execTimeMcs="not_executed" originalLayersNames="FakeQuantize_1874" outputLayouts="acdb" outputPrecisions="FP32" primitiveType="jit_avx2_FP32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Multiply_9216" type="Convolution">
			<data execOrder="265" execTimeMcs="not_executed" originalLayersNames="Multiply_9216,conv3_2_linear_bn_mean,FakeQuantize_1880,elementwise_add_0,FakeQuantize_1196" outputLayouts="acdb" outputPrecisions="FP32" primitiveType="jit_avx2_1x1_I8" runtimePrecision="U8" />
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="I8">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Multiply_9216_FP32_U8_Multiply_9223" type="Reorder">
			<data execOrder="266" execTimeMcs="not_executed" originalLayersNames="" outputLayouts="acdb" outputPrecisions="U8" primitiveType="jit_uni_FP32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="U8">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Constant_1550" type="Const">
			<data execOrder="207" execTimeMcs="not_executed" originalLayersNames="Constant_1550" outputLayouts="abcd" outputPrecisions="I8" primitiveType="unknown_I8" runtimePrecision="I8" />
			<output>
				<port id="0" precision="I8">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Constant_1550_abcd_ABcd2b8a4b_Multiply_9223" type="Reorder">
			<data execOrder="208" execTimeMcs="not_executed" originalLayersNames="" outputLayouts="ABcd2b8a4b" outputPrecisions="I8" primitiveType="jit_uni_I8" runtimePrecision="I8" />
			<input>
				<port id="0" precision="I8">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I8">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_11579" type="Const">
			<data execOrder="206" execTimeMcs="not_executed" originalLayersNames="Constant_11579" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Multiply_9223" type="Convolution">
			<data execOrder="267" execTimeMcs="not_executed" originalLayersNames="Multiply_9223,conv4_1_expand_bn_mean,Multiply_11575,relu6_7.tmp_0,FakeQuantize_1202" outputLayouts="acdb" outputPrecisions="U8" primitiveType="jit_avx2_1x1_I8" runtimePrecision="U8" />
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>24</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="I8">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="U8">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Constant_11626" type="Const">
			<data execOrder="204" execTimeMcs="not_executed" originalLayersNames="Constant_11626" outputLayouts="abcde" outputPrecisions="I8" primitiveType="unknown_I8" runtimePrecision="I8" />
			<output>
				<port id="0" precision="I8">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Constant_11626_abcde_Abcde8a_Multiply_9230" type="Reorder">
			<data execOrder="205" execTimeMcs="not_executed" originalLayersNames="" outputLayouts="Abcde8a" outputPrecisions="I8" primitiveType="jit_uni_I8" runtimePrecision="I8" />
			<input>
				<port id="0" precision="I8">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I8">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_11633" type="Const">
			<data execOrder="203" execTimeMcs="not_executed" originalLayersNames="Constant_11633" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Multiply_9230" type="Convolution">
			<data execOrder="268" execTimeMcs="not_executed" originalLayersNames="Multiply_9230,conv4_1_dwise_bn_mean,Multiply_11629,relu6_8.tmp_0,FakeQuantize_1208" outputLayouts="acdb" outputPrecisions="U8" primitiveType="jit_avx2_I8" runtimePrecision="U8" />
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>144</dim>
					<dim>56</dim>
					<dim>56</dim>
				</port>
				<port id="1" precision="I8">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="U8">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_1564" type="Const">
			<data execOrder="201" execTimeMcs="not_executed" originalLayersNames="Constant_1564" outputLayouts="abcd" outputPrecisions="I8" primitiveType="unknown_I8" runtimePrecision="I8" />
			<output>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_1564_abcd_ABcd2b8a4b_Multiply_9237" type="Reorder">
			<data execOrder="202" execTimeMcs="not_executed" originalLayersNames="" outputLayouts="ABcd2b8a4b" outputPrecisions="I8" primitiveType="jit_uni_I8" runtimePrecision="I8" />
			<input>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I8">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Constant_11677" type="Const">
			<data execOrder="200" execTimeMcs="not_executed" originalLayersNames="Constant_11677" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Multiply_9237" type="Convolution">
			<data execOrder="269" execTimeMcs="not_executed" originalLayersNames="Multiply_9237,conv4_1_linear_bn_mean,Multiply_11673" outputLayouts="acdb" outputPrecisions="FP32" primitiveType="jit_avx2_1x1_I8" runtimePrecision="U8" />
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>144</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="I8">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Constant_1210" type="Const">
			<data execOrder="195" execTimeMcs="not_executed" originalLayersNames="Constant_1210" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Constant_1211" type="Const">
			<data execOrder="194" execTimeMcs="not_executed" originalLayersNames="Constant_1211" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_11692" type="Const">
			<data execOrder="193" execTimeMcs="not_executed" originalLayersNames="Constant_11692" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Constant_11693" type="Const">
			<data execOrder="192" execTimeMcs="not_executed" originalLayersNames="Constant_11693" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="FakeQuantize_1214" type="FakeQuantize">
			<data execOrder="271" execTimeMcs="not_executed" originalLayersNames="FakeQuantize_1214" outputLayouts="acdb" outputPrecisions="U8" primitiveType="jit_avx2_FP32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="U8">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_1569" type="Const">
			<data execOrder="190" execTimeMcs="not_executed" originalLayersNames="Constant_1569" outputLayouts="abcd" outputPrecisions="I8" primitiveType="unknown_I8" runtimePrecision="I8" />
			<output>
				<port id="0" precision="I8">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Constant_1569_abcd_ABcd2b8a4b_Multiply_9244" type="Reorder">
			<data execOrder="191" execTimeMcs="not_executed" originalLayersNames="" outputLayouts="ABcd2b8a4b" outputPrecisions="I8" primitiveType="jit_uni_I8" runtimePrecision="I8" />
			<input>
				<port id="0" precision="I8">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I8">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Constant_11729" type="Const">
			<data execOrder="189" execTimeMcs="not_executed" originalLayersNames="Constant_11729" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Multiply_9244" type="Convolution">
			<data execOrder="272" execTimeMcs="not_executed" originalLayersNames="Multiply_9244,conv4_2_expand_bn_mean,Multiply_11725,relu6_9.tmp_0,FakeQuantize_1220" outputLayouts="acdb" outputPrecisions="U8" primitiveType="jit_avx2_1x1_I8" runtimePrecision="U8" />
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="I8">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="U8">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Constant_11776" type="Const">
			<data execOrder="187" execTimeMcs="not_executed" originalLayersNames="Constant_11776" outputLayouts="abcde" outputPrecisions="I8" primitiveType="unknown_I8" runtimePrecision="I8" />
			<output>
				<port id="0" precision="I8">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Constant_11776_abcde_Abcde8a_Multiply_9251" type="Reorder">
			<data execOrder="188" execTimeMcs="not_executed" originalLayersNames="" outputLayouts="Abcde8a" outputPrecisions="I8" primitiveType="jit_uni_I8" runtimePrecision="I8" />
			<input>
				<port id="0" precision="I8">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I8">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Constant_11783" type="Const">
			<data execOrder="186" execTimeMcs="not_executed" originalLayersNames="Constant_11783" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Multiply_9251" type="Convolution">
			<data execOrder="273" execTimeMcs="not_executed" originalLayersNames="Multiply_9251,conv4_2_dwise_bn_mean,Multiply_11779,relu6_10.tmp_0,FakeQuantize_1226" outputLayouts="acdb" outputPrecisions="U8" primitiveType="jit_avx2_I8" runtimePrecision="U8" />
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="I8">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="U8">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Constant_1583" type="Const">
			<data execOrder="184" execTimeMcs="not_executed" originalLayersNames="Constant_1583" outputLayouts="abcd" outputPrecisions="I8" primitiveType="unknown_I8" runtimePrecision="I8" />
			<output>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Constant_1583_abcd_ABcd2b8a4b_Multiply_9258" type="Reorder">
			<data execOrder="185" execTimeMcs="not_executed" originalLayersNames="" outputLayouts="ABcd2b8a4b" outputPrecisions="I8" primitiveType="jit_uni_I8" runtimePrecision="I8" />
			<input>
				<port id="0" precision="I8">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I8">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Constant_11827" type="Const">
			<data execOrder="183" execTimeMcs="not_executed" originalLayersNames="Constant_11827" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_1882" type="Const">
			<data execOrder="199" execTimeMcs="not_executed" originalLayersNames="Constant_1882" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Constant_1883" type="Const">
			<data execOrder="198" execTimeMcs="not_executed" originalLayersNames="Constant_1883" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Constant_11683" type="Const">
			<data execOrder="197" execTimeMcs="not_executed" originalLayersNames="Constant_11683" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_11684" type="Const">
			<data execOrder="196" execTimeMcs="not_executed" originalLayersNames="Constant_11684" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="FakeQuantize_1886" type="FakeQuantize">
			<data execOrder="270" execTimeMcs="not_executed" originalLayersNames="FakeQuantize_1886" outputLayouts="acdb" outputPrecisions="FP32" primitiveType="jit_avx2_FP32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Multiply_9258" type="Convolution">
			<data execOrder="274" execTimeMcs="not_executed" originalLayersNames="Multiply_9258,conv4_2_linear_bn_mean,FakeQuantize_1892,elementwise_add_1" outputLayouts="acdb" outputPrecisions="FP32" primitiveType="jit_avx2_1x1_I8" runtimePrecision="U8" />
			<input>
				<port id="0" precision="U8">
					<dim>1</dim>
					<dim>192</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="I8">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_11895" type="Const">
			<data execOrder="178" execTimeMcs="not_executed" originalLayersNames="Constant_11895" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Constant_11897" type="Const">
			<data execOrder="177" execTimeMcs="not_executed" originalLayersNames="Constant_11897" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Constant_11888" type="Const">
			<data execOrder="176" execTimeMcs="not_executed" originalLayersNames="Constant_11888" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_11889" type="Const">
			<data execOrder="175" execTimeMcs="not_executed" originalLayersNames="Constant_11889" outputLayouts="a" outputPrecisions="FP32" primitiveType="unknown_FP32" runtimePrecision="FP32" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="FakeQuantize_1232" type="FakeQuantize">
			<data execOrder="276" execTimeMcs="not_executed" originalLayersNames="FakeQuantize_1232" outputLayouts="acdb" outputPrecisions="U8" primitiveType="jit_avx2_FP32" runtimePrecision="FP32" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
