ir_version: 6
producer_name: "pytorch"
producer_version: "1.8"
graph {
  node {
    output: "884"
    name: "Constant_10"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
        raw_data: "\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "885"
    name: "Constant_11"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
        raw_data: "6\241\311@"
      }
      type: TENSOR
    }
  }
  node {
    input: "883"
    input: "884"
    input: "885"
    input: "884"
    input: "885"
    output: "886"
    name: "FakeQuantize_12"
    op_type: "FakeQuantize"
    attribute {
      name: "levels"
      i: 256
      type: INT
    }
    domain: "org.openvinotoolkit"
  }
  node {
    input: "886"
    output: "887"
    name: "MaxPool_13"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 0
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  name: "torch-jit-export"
  input {
    name: "883"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 112
          }
          dim {
            dim_value: 112
          }
        }
      }
    }
  }
  output {
    name: "887"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 56
          }
          dim {
            dim_value: 56
          }
        }
      }
    }
  }
}
opset_import {
  version: 10
}
opset_import {
  domain: "org.openvinotoolkit"
  version: 1
}
