ir_version: 12
producer_name: "ONNX Celu"
model_version: 0
graph {
  name: "test"
  node {
    input: "X"
    output: "Y"
    name: "node1"
    op_type: "Celu"
    attribute {
      name: "alpha"
      f: -0.5
      type: FLOAT
    }
    doc_string: "Celu"
  }
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 13
          }
        }
      }
    }
  }
  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 13
          }
        }
      }
    }
  }
}
opset_import {
  version: 12
}
