ir_version: 3
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "A"
    input: "B"
    output: "X"
    name: "add"
    op_type: "Add"
    attribute {
      name: "broadcast"
      i: 1
      type: INT
    }
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  name: "test_graph"
  input {
    name: "A"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "N"
          }
          dim {
            dim_param: "C"
          }
          dim {
            dim_param: "H"
          }
          dim {
            dim_param: "W"
          }
        }
      }
    }
  }
  input {
    name: "B"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_param: "C"
          }
        }
      }
    }
  }
  output {
    name: "X"
    type {
      tensor_type {
        elem_type: 1
        shape {
        }
      }
    }
  }
}
opset_import {
  version: 6
}
