ir_version: 3
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "data"
    output: "result"
    op_type: "ArgMin"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
    attribute {
      name: "keepdims"
      i: 0
      type: INT
    }
  }
  name: "test_argmin_no_keepdims_example"
  input {
    name: "data"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "result"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  version: 8
}
