ir_version: 3
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "data"
    output: "reduced"
    name: "node1"
    op_type: "ArgMin"
    attribute {
      name: "keepdims"
      i: 0
      type: INT
    }
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
    doc_string: "ArgMin"
    domain: ""
  }
  name: "test"
  input {
    name: "data"
    type {
      tensor_type {
        elem_type: 6
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "reduced"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  version: 7
}
