ir_version: 10
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "Q"
    input: "K"
    input: "V"
    input: "M"
    output: "Y"
    name: "Attention_1"
    op_type: "Attention"
  }
  name: "attention_opset24_short_mask"
  input {
    name: "Q"
    type { tensor_type { elem_type: 1
      shape { dim { dim_value: 1 } dim { dim_value: 2 } dim { dim_value: 3 } dim { dim_value: 4 } } } }
  }
  input {
    name: "K"
    type { tensor_type { elem_type: 1
      shape { dim { dim_value: 1 } dim { dim_value: 2 } dim { dim_value: 5 } dim { dim_value: 4 } } } }
  }
  input {
    name: "V"
    type { tensor_type { elem_type: 1
      shape { dim { dim_value: 1 } dim { dim_value: 2 } dim { dim_value: 5 } dim { dim_value: 4 } } } }
  }
  input {
    name: "M"
    type { tensor_type { elem_type: 1
      shape { dim { dim_value: 1 } dim { dim_value: 2 } dim { dim_value: 3 } dim { dim_value: 2 } } } }
  }
  output {
    name: "Y"
    type { tensor_type { elem_type: 1
      shape { dim { dim_value: 1 } dim { dim_value: 2 } dim { dim_value: 3 } dim { dim_value: 4 } } } }
  }
}
opset_import { version: 24 }
