ir_version: 10
producer_name: "OpenVINO ONNX Frontend"
graph {
  name: "averagepool_2d_dilations_large_count_include_pad_is_1_ceil_mode_is_True"
  node {
    input: "x"
    output: "y"
    op_type: "AveragePool"
    attribute {
      name: "ceil_mode"
      i: 1
      type: INT
    }
    attribute {
      name: "count_include_pad"
      i: 1
      type: INT
    }
    attribute {
      name: "dilations"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 5
      ints: 5
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 3
      ints: 3
      type: INTS
    }
  }
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 32
          }
          dim {
            dim_value: 32
          }
        }
      }
    }
  }
  output {
    name: "y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 9
          }
          dim {
            dim_value: 9
          }
        }
      }
    }
  }
}
opset_import {
  version: 22
}
