ir_version: 7
producer_name: "OpenVINO ONNX Frontend"
graph {
  name: "bfloat16_raw_initializer"
  initializer {
    dims: 2
    dims: 2
    data_type: 16
    name: "const_input"
    raw_data: "\200\077\000\100\100\100\200\100"
  }
  input {
    name: "const_input"
    type {
      tensor_type {
        elem_type: 16
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  node {
    input: "const_input"
    output: "const_output"
    name: "Identity_bfloat16"
    op_type: "Identity"
  }
  output {
    name: "const_output"
    type {
      tensor_type {
        elem_type: 16
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  version: 13
}
