ir_version: 10
producer_name: "onnx-example"
graph {
  node {
    output: "add_constant"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        float_data: 2.0
        name: "add_constant"
      }
      type: TENSOR
    }
  }
  node {
    input: "input"
    output: "softsign_output"
    op_type: "Softsign"
  }
  node {
    input: "softsign_output"
    input: "add_constant"
    output: "acosh_input"
    op_type: "Add"
  }
  node {
    input: "acosh_input"
    output: "acosh_output"
    op_type: "Acosh"
  }
  node {
    input: "acosh_output"
    output: "sigmoid_output"
    op_type: "Sigmoid"
  }
  node {
    input: "sigmoid_output"
    output: "bitshift_input"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 12
      type: INT
    }
  }
  node {
    output: "bitshift_amount"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 3
        dims: 4
        dims: 4
        data_type: 12
        name: "bitshift_amount"
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
        uint64_data: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "bitshift_input"
    input: "bitshift_amount"
    output: "bitshift_output"
    op_type: "BitShift"
    attribute {
      name: "direction"
      s: "LEFT"
      type: STRING
    }
  }
  node {
    input: "bitshift_output"
    output: "cast_output"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "cast_output"
    output: "unique_output_y"
    output: "unique_output_indices"
    output: "unique_output_inverse_indices"
    output: "unique_output_counts"
    op_type: "Unique"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
    attribute {
      name: "sorted"
      i: 1
      type: INT
    }
  }
  name: "complex_model"
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "unique_output_y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
          }
          dim {
          }
          dim {
          }
        }
      }
    }
  }
  output {
    name: "unique_output_indices"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
          }
        }
      }
    }
  }
  output {
    name: "unique_output_inverse_indices"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
          }
        }
      }
    }
  }
  output {
    name: "unique_output_counts"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
          }
        }
      }
    }
  }
}
opset_import {
  version: 22
}
