ir_version: 3
producer_name: "OpenVINO ONNX Frontend"
graph {
  name: "test_graph"
  node {
    input: "A"
    input: "B"
    output: "Y"
    name: "node"
    op_type: "Or"
  }
  input {
    name: "A"
    type {
      tensor_type {
        elem_type: 9
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "B"
    type {
      tensor_type {
        elem_type: 9
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 9
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  version: 4
}
