ir_version: 8
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "input"
    input: "like"
    output: "output"
    op_type: "CastLike"
  }
  name: "test-model"
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 3
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "like"
    type {
      tensor_type {
        elem_type: 10
        shape {
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "output"
    type {
      tensor_type {
        elem_type: 10
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 15
}
