ir_version: 10
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "input"
    output: "output"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 22
      type: INT
    }
  }
  name: "test-model-cast"
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "output"
    type {
      tensor_type {
        elem_type: 22
        shape {
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 21
}
