ir_version: 7
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "X"
    output: "Y"
    op_type: "Celu"
    attribute {
      name: "alpha"
      f: 1.0
      type: FLOAT
    }
  }
  name: "test_celu_float"
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  version: 12
}
