ir_version: 8
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "X"
    input: ""
    input: "MAX"
    output: "Y"
    op_type: "Clip"
  }
  name: "test-model-clip"
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "MAX"
    type {
      tensor_type {
        elem_type: 7
        shape {
        }
      }
    }
  }
  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 12
}
