ir_version: 3
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "input"
    input: "condition"
    output: "output"
    op_type: "Compress"
  }
  name: "test_compress_default_axis"
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "condition"
    type {
      tensor_type {
        elem_type: 9
        shape {
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  output {
    name: "output"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
