ir_version: 3
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "value0"
    input: "value1"
    output: "output"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: -2
      type: INT
    }
  }
  name: "test_concat_1d_axis_0"
  input {
    name: "value0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "value1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "output"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  version: 7
}
