ir_version: 7
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    output: "values"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        dims: 3
        data_type: 1
        float_data: 0
        float_data: 0.5
        float_data: 1.0
        float_data: 1.5
        float_data: 2
        float_data: 2.5
        name: "const_tensor"
      }
      type: TENSOR
    }
  }
  name: "test_constant"
  output {
    name: "values"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
}
opset_import {
  version: 13
}
