ir_version: 7
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    output: "values"
    op_type: "Constant"
    attribute {
      name: "value_ints"
      ints: 0
      ints: 1
      ints: 2
      type: INTS
    }
  }
  name: "test_constant"
  output {
    name: "values"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim{
            dim_value: 3
          }
        }
      }
    }
  }
}
opset_import {
  version: 13
}
