ir_version: 7
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    output: "dense_constant"
    op_type: "Constant"
    attribute {
      name: "sparse_value"
      type: SPARSE_TENSOR
      sparse_tensor {
        values {
          dims: 22
          data_type: 1
          float_data: 1
          float_data: 1
          float_data: 1
          float_data: 1
          float_data: 1
          float_data: 1
          float_data: 1
          float_data: 1
          float_data: 1
          float_data: 1
          float_data: 1
          float_data: 1
          float_data: 1
          float_data: 1
          float_data: 1
          float_data: 1
          float_data: 1
          float_data: 1
          float_data: 1
          float_data: 1
          float_data: 1
          float_data: 1
          name: "values"
        }
        indices {
          dims: 22
          dims: 2
          data_type: 7
          int64_data: 0
          int64_data: 7
          int64_data: 1
          int64_data: 6
          int64_data: 1
          int64_data: 8
          int64_data: 2
          int64_data: 4
          int64_data: 2
          int64_data: 5
          int64_data: 2
          int64_data: 9
          int64_data: 2
          int64_data: 10
          int64_data: 3
          int64_data: 3
          int64_data: 3
          int64_data: 4
          int64_data: 3
          int64_data: 10
          int64_data: 3
          int64_data: 11
          int64_data: 4
          int64_data: 3
          int64_data: 4
          int64_data: 4
          int64_data: 4
          int64_data: 10
          int64_data: 4
          int64_data: 11
          int64_data: 5
          int64_data: 4
          int64_data: 5
          int64_data: 5
          int64_data: 5
          int64_data: 9
          int64_data: 5
          int64_data: 10
          int64_data: 6
          int64_data: 6
          int64_data: 6
          int64_data: 8
          int64_data: 7
          int64_data: 7
          name: "indices"
        }
        dims: 8
        dims: 17
      }
    }
  }
  name: "test_sparse_tensor"
  output {
    name: "dense_constant"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 8
          },
          dim {
            dim_value: 17
          }
        }
      }
    }
  }
}
opset_import {
  version: 13
}
