ir_version: 7
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    output: "values"
    op_type: "Constant"
    attribute {
      name: "value_float"
      f: 0.5
      type: FLOAT
    }
  }
  name: "test_constant"
  output {
    name: "values"
    type {
      tensor_type {
        elem_type: 1
        shape {

        }
      }
    }
  }
}
opset_import {
  version: 13
}
