ir_version: 7
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "x"
    input: "W"
    output: "y"
    op_type: "Conv"
  }
  name: "test Conv fp16 W-tensor as int32_data"
  initializer {
    dims: 1
    dims: 1
    dims: 3
    dims: 3
    data_type: 10
    int32_data: 13312 # 0.25
    int32_data: 14336 # 0.5
    int32_data: 13312 # 0.25
    int32_data: 14336 # 0.5
    int32_data: 15360 # 1.0
    int32_data: 14336 # 0.5
    int32_data: 13312 # 0.25
    int32_data: 14336 # 0.5
    int32_data: 13312 # 0.25
    name: "W"
  }
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 10
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "y"
    type {
      tensor_type {
        elem_type: 10
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  version: 13
}
