ir_version: 3
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "x"
    output: "y"
    op_type: "Crop"
    attribute {
      name: "border"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
  }
  name: "test_model"
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  version: 1
}
