ir_version: 3
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "X"
    input: "scale"
    input: "zero_point"
    output: "Y"
    name: "node1"
    op_type: "DequantizeLinear"
    attribute {
      name: "axis"
      i: -2
      type: INT
    }
  }
  name: "test"
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 2
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "scale"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "zero_point"
    type {
      tensor_type {
        elem_type: 2
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  version: 13
}
