ir_version: 7
graph {
  node {
    input: "data"
    output: "out"
    op_type: "DFT"
    attribute {
      name: "inverse"
      i: 0
      type: INT
    }
    attribute {
      name: "onesided"
      i: 1
      type: INT
    }
  }
  input {
    name: "data"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "out"
    type {
      tensor_type {
        elem_type: 1
        shape {
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 13
}
