ir_version: 3
producer_name: "OpenVINO ONNX Frontend"
model_version: 1
graph {
  node {
    input: "Input3"
    input: "Input4"
    output: "Block17_Output_0"
    name: "Block17"
    op_type: "Div"
    attribute {
      name: "broadcast"
      i: 0
      type: INT
    }
    doc_string: ""
    domain: ""
  }
  name: "CNTKGraph"
  input {
    name: "Input3"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "Input4"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "Block17_Output_0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 2
}
