ir_version: 13
producer_name: "OpenVINO ONNX Frontend"
graph {
  name: ""
  node {
    input: "inputA"
    input: "shape"
    output: "expandOutput_0"
    name: "_0"
    op_type: "Expand"
  }
  initializer {
    dims: 0
    data_type: 7
    name: "shape"
    external_data {
        key: "location",
        value: "*/_ORT_MEM_ADDR_/*"
    }
    external_data {
        key: "offset",
        value: "0"
    }
    external_data {
        key: "length",
        value: "0"
    }
    data_location: 1
  }
  input {
    name: "inputA"
    type {
      tensor_type {
        elem_type: 1
        shape {
        }
      }
    }
  }
  output {
    name: "expandOutput_0"
    type {
      tensor_type {
        elem_type: 1
        shape {
        }
      }
    }
  }
}
opset_import {
  version: 25
}
