ir_version: 7
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "data"
    input: "indices"
    output: "output"
    op_type: "GatherElements"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  name: "test_gather_elements"
  input {
    name: "data"
    type {
      tensor_type {
        elem_type: 3
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "indices"
    type {
      tensor_type {
        elem_type: 6
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "output"
    type {
      tensor_type {
        elem_type: 3
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  version: 13
}
