ir_version: 4
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "input"
    output: "output"
    op_type: "GlobalLpPool"
    attribute {
      name: "p"
      i: 0
      type: INT
    }
  }
  name: "compute_graph"
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_param: "batch"
          }
          dim {
            dim_param: "batch"
          }
        }
      }
    }
  }
  output {
    name: "output"
    type {
      tensor_type {
        elem_type: 7
        shape {
        }
      }
    }
  }
}
opset_import {
  version: 1
}
