ir_version: 7
producer_name: "nGraph ONNX Importer"
graph {
  node {
    input: "A"
    input: "B"
    output: "C"
    op_type: "Greater_Or_Equal"
  }
  name: "test_greater_or_equal_float"
  input {
    name: "A"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "B"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "C"
    type {
      tensor_type {
        elem_type: 2
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  version: 16
}
