ir_version: 8
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "X"
    input: "Grid"
    output: "Y"
    op_type: "GridSample"
    attribute {
      name: "align_corners"
      i: 0
      type: INT
    }
    attribute {
      name: "mode"
      s: "bilinear"
      type: STRING
    }
    attribute {
      name: "padding_mode"
      s: "zeros"
      type: STRING
    }
  }
  name: "test_gridsample"
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "Grid"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 6
          }
          dim {
            dim_value: 6
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 6
          }
          dim {
            dim_value: 6
          }
        }
      }
    }
  }
}
opset_import {
  version: 16
}
