ir_version: 10
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "x"
    input: "scale"
    input: "bias"
    output: "y"
    op_type: "GroupNormalization"
    attribute {
      name: "epsilon"
      f: 0.0099999997764825821
      type: FLOAT
    }
    attribute {
      name: "num_groups"
      i: 2
      type: INT
    }
  }
  name: "test_group_normalization_epsilon"
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "scale"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "bias"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 21
}
