ir_version: 3
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "X"
    input: "W"
    input: "R"
    input: "B"
    output: "Y"
    output: "Y_h"
    op_type: "GRU"
    attribute {
      name: "hidden_size"
      i: 5
      type: INT
    }
    attribute {
      name: "linear_before_reset"
      i: 1
      type: INT
    }
  }
  name: "test_gru_fwd_linear_before_reset_bias"
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 4  # seq_length
          }
          dim {
            dim_value: 3  # batch size
          }
          dim {
            dim_value: 2  # input size
          }
        }
      }
    }
  }
  input {
    name: "W"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1  # num_directions
          }
          dim {
            dim_value: 15 # gates_count*hidden_size
          }
          dim {
            dim_value: 2  # input_size
          }
        }
      }
    }
  }
  input {
    name: "R"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1  # num_directions
          }
          dim {
            dim_value: 15  # gates_count*hidden_size
          }
          dim {
            dim_value: 5  # hidden_size
          }
        }
      }
    }
  }
  input {
    name: "B"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1  # num_directions
          }
          dim {
            dim_value: 30  # 2 * gates_count * hidden_size
          }
        }
      }
    }
  }
  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 4 # seq_length
          }
          dim {
            dim_value: 1 # num_directions
          }
          dim {
            dim_value: 3 # batch_size
          }
          dim {
            dim_value: 5 # hidden_size
          }
        }
      }
    }
  }
  output {
    name: "Y_h"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1 # num_directions
          }
          dim {
            dim_value: 3 # batch_size
          }
          dim {
            dim_value: 5 # hidden_size
          }
        }
      }
    }
  }
}
opset_import {
  version: 9
}
