ir_version: 7
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "data"
    output: "y"
    op_type: "LogSoftmax"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  name: "LogSoftmax test"
  input {
    name: "data"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
}
opset_import {
  version: 1
}
