ir_version: 10
producer_name: "openvino_test"
graph {
  node {
    input: "X"
    input: "W"
    input: "R"
    input: "B"
    input: ""
    input: "initial_h"
    input: "initial_c"
    output: "Y"
    output: "Y_h"
    output: "Y_c"
    op_type: "LSTM"
    attribute {
      name: "hidden_size"
      i: 128
      type: INT
    }
  }
  name: "lstm_batch_broadcast_test"
  initializer {
    dims: 1
    dims: 512
    dims: 4
    data_type: 1
    float_data: 0.049671415
    float_data: -0.01382643
    float_data: 0.06476886
    float_data: 0.15230298
    float_data: -0.023415338
    float_data: -0.023413695
    float_data: 0.15792128
    float_data: 0.076743476
    float_data: -0.04694744
    float_data: 0.054256003
    float_data: -0.04634177
    float_data: -0.046572976
    float_data: 0.024196228
    float_data: -0.19132803
    float_data: -0.17249179
    float_data: -0.056228753
    float_data: -0.10128311
    float_data: 0.031424735
    float_data: -0.09080241
    float_data: -0.14123037
    float_data: 0.14656489
    float_data: -0.02257763
    float_data: 0.00675282
    float_data: -0.14247482
    float_data: -0.054438274
    float_data: 0.01109226
    float_data: -0.11509936
    float_data: 0.037569802
    float_data: -0.06006387
    float_data: -0.029169375
    float_data: -0.06017066
    float_data: 0.18522783
    float_data: -0.0013497225
    float_data: -0.10577109
    float_data: 0.08225449
    float_data: -0.12208437
    float_data: 0.02088636
    float_data: -0.195967
    float_data: -0.13281861
    float_data: 0.019686123
    float_data: 0.07384666
    float_data: 0.017136829
    float_data: -0.011564828
    float_data: -0.030110369
    float_data: -0.1478522
    float_data: -0.071984425
    float_data: -0.046063878
    float_data: 0.10571223
    float_data: 0.03436183
    float_data: -0.17630403
    float_data: 0.032408398
    float_data: -0.03850823
    float_data: -0.067692205
    float_data: 0.061167628
    float_data: 0.10309996
    float_data: 0.09312802
    float_data: -0.08392175
    float_data: -0.03092124
    float_data: 0.033126343
    float_data: 0.09755451
    float_data: -0.047917422
    float_data: -0.018565899
    float_data: -0.11063349
    float_data: -0.11962066
    float_data: 0.08125258
    float_data: 0.135624
    float_data: -0.007201012
    float_data: 0.10035329
    float_data: 0.036163602
    float_data: -0.06451198
    float_data: 0.03613956
    float_data: 0.15380366
    float_data: -0.003582604
    float_data: 0.15646437
    float_data: -0.2619745
    float_data: 0.08219025
    float_data: 0.008704707
    float_data: -0.029900735
    float_data: 0.009176078
    float_data: -0.19875689
    float_data: -0.02196719
    float_data: 0.035711255
    float_data: 0.1477894
    float_data: -0.05182702
    float_data: -0.080849364
    float_data: -0.050175704
    float_data: 0.09154021
    float_data: 0.032875113
    float_data: -0.05297602
    float_data: 0.051326748
    float_data: 0.009707755
    float_data: 0.0968645
    float_data: -0.07020531
    float_data: -0.032766216
    float_data: -0.039210815
    float_data: -0.1463515
    float_data: 0.029612029
    float_data: 0.026105527
    float_data: 0.0005113457
    float_data: -0.023458714
    float_data: -0.14153707
    float_data: -0.042064533
    float_data: -0.034271453
    float_data: -0.080227725
    float_data: -0.016128572
    float_data: 0.040405087
    float_data: 0.18861859
    float_data: 0.017457781
    float_data: 0.025755038
    float_data: -0.0074445917
    float_data: -0.19187713
    float_data: -0.0026513876
    float_data: 0.006023021
    float_data: 0.24632421
    float_data: -0.019236097
    float_data: 0.030154735
    float_data: -0.003471177
    float_data: -0.1168678
    float_data: 0.11428229
    float_data: 0.07519331
    float_data: 0.079103194
    float_data: -0.09093875
    float_data: 0.14027944
    float_data: -0.1401851
    float_data: 0.05868571
    float_data: 0.21904556
    float_data: -0.099053636
    float_data: -0.056629773
    float_data: 0.009965137
    float_data: -0.050347567
    float_data: -0.15506636
    float_data: 0.0068562976
    float_data: -0.10623037
    float_data: 0.047359243
    float_data: -0.09194242
    float_data: 0.15499344
    float_data: -0.07832533
    float_data: -0.03220615
    float_data: 0.08135172
    float_data: -0.12308643
    float_data: 0.022745995
    float_data: 0.13071428
    float_data: -0.16074833
    float_data: 0.018463386
    float_data: 0.02598828
    float_data: 0.07818229
    float_data: -0.123695076
    float_data: -0.13204567
    float_data: 0.052194156
    float_data: 0.029698467
    float_data: 0.025049284
    float_data: 0.034644824
    float_data: -0.06800248
    float_data: 0.02322537
    float_data: 0.029307246
    float_data: -0.071435146
    float_data: 0.18657745
    float_data: 0.047383294
    float_data: -0.11913035
    float_data: 0.065655366
    float_data: -0.09746817
    float_data: 0.07870846
    float_data: 0.11585956
    float_data: -0.082068235
    float_data: 0.09633761
    float_data: 0.041278094
    float_data: 0.08220602
    float_data: 0.18967931
    float_data: -0.024538813
    float_data: -0.07537361
    float_data: -0.088951446
    float_data: -0.08158103
    float_data: -0.007710171
    float_data: 0.0341152
    float_data: 0.027669081
    float_data: 0.08271833
    float_data: 0.0013001892
    float_data: 0.14535342
    float_data: -0.026465684
    float_data: 0.2720169
    float_data: 0.062566735
    float_data: -0.085715756
    float_data: -0.107089244
    float_data: 0.048247244
    float_data: -0.022346279
    float_data: 0.071400054
    float_data: 0.047323763
    float_data: -0.0072828913
    float_data: -0.08467937
    float_data: -0.15148473
    float_data: -0.044651497
    float_data: 0.08563989
    float_data: 0.021409376
    float_data: -0.12457388
    float_data: 0.017318092
    float_data: 0.03853174
    float_data: -0.088385746
    float_data: 0.01537251
    float_data: 0.005820872
    float_data: -0.11429703
    float_data: 0.03577874
    float_data: 0.056078453
    float_data: 0.10830512
    float_data: 0.1053802
    float_data: -0.13776694
    float_data: -0.09378251
    float_data: 0.051503528
    float_data: 0.051378597
    float_data: 0.05150477
    float_data: 0.38527316
    float_data: 0.05708905
    float_data: 0.113556564
    float_data: 0.09540018
    float_data: 0.06513913
    float_data: -0.031526923
    float_data: 0.075896926
    float_data: -0.077282526
    float_data: -0.023681862
    float_data: -0.048536357
    float_data: 0.008187414
    float_data: 0.23146586
    float_data: -0.18672653
    float_data: 0.06862602
    float_data: -0.16127159
    float_data: -0.04719319
    float_data: 0.10889506
    float_data: 0.006428002
    float_data: -0.107774474
    float_data: -0.07153037
    float_data: 0.06795978
    float_data: -0.07303666
    float_data: 0.021645859
    float_data: 0.0045571844
    float_data: -0.065160036
    float_data: 0.2143944
    float_data: 0.0633919
    float_data: -0.20251428
    float_data: 0.018645432
    float_data: -0.06617864
    float_data: 0.08524334
    float_data: -0.07925208
    float_data: -0.011473644
    float_data: 0.05049873
    float_data: 0.08657552
    float_data: -0.12002964
    float_data: -0.033450123
    float_data: -0.04749453
    float_data: -0.06533293
    float_data: 0.17654543
    float_data: 0.04049817
    float_data: -0.1260884
    float_data: 0.0917862
    float_data: 0.21221562
    float_data: 0.103246525
    float_data: -0.151937
    float_data: -0.048423406
    float_data: 0.12669112
    float_data: -0.07076695
    float_data: 0.044381943
    float_data: 0.07746341
    float_data: -0.09269305
    float_data: -0.0059525357
    float_data: -0.32412675
    float_data: -0.10243876
    float_data: -0.025256816
    float_data: -0.12477832
    float_data: 0.16324113
    float_data: -0.14301413
    float_data: -0.04400445
    float_data: 0.013074058
    float_data: 0.14412734
    float_data: -0.14358622
    float_data: 0.11631638
    float_data: 0.0010233062
    float_data: -0.09815087
    float_data: 0.04621035
    float_data: 0.01990597
    float_data: -0.060021687
    float_data: 0.006980208
    float_data: -0.03853136
    float_data: 0.011351734
    float_data: 0.066213064
    float_data: 0.15860169
    float_data: -0.123781554
    float_data: 0.21330333
    float_data: -0.19520877
    float_data: -0.015178509
    float_data: 0.05883172
    float_data: 0.028099189
    float_data: -0.062269952
    float_data: -0.020812226
    float_data: -0.049300093
    float_data: -0.058936477
    float_data: 0.084960215
    float_data: 0.03570155
    float_data: -0.06929096
    float_data: 0.08995999
    float_data: 0.030729953
    float_data: 0.081286214
    float_data: 0.06296288
    float_data: -0.0828995
    float_data: -0.056018103
    float_data: 0.07472936
    float_data: 0.06103703
    float_data: -0.0020901596
    float_data: 0.011732738
    float_data: 0.12776649
    float_data: -0.05915714
    float_data: 0.05470974
    float_data: -0.020219265
    float_data: -0.021768121
    float_data: 0.10987768
    float_data: 0.08254164
    float_data: 0.08135097
    float_data: 0.13054788
    float_data: 0.0021003843
    float_data: 0.0681953
    float_data: -0.031026676
    float_data: 0.032416638
    float_data: -0.013014306
    float_data: 0.009699597
    float_data: 0.059515703
    float_data: -0.08182207
    float_data: 0.20923872
    float_data: -0.10060173
    float_data: -0.121418856
    float_data: 0.11581109
    float_data: 0.07916627
    float_data: 0.062411983
    float_data: 0.06283455
    float_data: -0.0012246773
    float_data: -0.089725435
    float_data: 0.0075804563
    float_data: -0.067716174
    float_data: 0.09751197
    float_data: -0.014705739
    float_data: -0.08254972
    float_data: -0.032138582
    float_data: 0.041293144
    float_data: -0.05637246
    float_data: -0.08222204
    float_data: 0.024368722
    float_data: 0.024496658
    float_data: -0.050694317
    float_data: -0.047103833
    float_data: 0.023204995
    float_data: -0.14480844
    float_data: -0.14074638
    float_data: -0.07184442
    float_data: -0.021344716
    float_data: 0.031090757
    float_data: 0.14753562
    float_data: 0.085765965
    float_data: -0.015993854
    float_data: -0.0019016209
    float_data: -0.10025294
    float_data: -0.0018513136
    float_data: -0.028865865
    float_data: 0.03227186
    float_data: -0.082723096
    float_data: 0.051934656
    float_data: 0.1532739
    float_data: -0.010876015
    float_data: 0.040171172
    float_data: 0.0690144
    float_data: -0.040122047
    float_data: 0.02240925
    float_data: 0.0012592401
    float_data: 0.00976761
    float_data: -0.07730098
    float_data: 0.0024510175
    float_data: 0.04979983
    float_data: 0.14511436
    float_data: 0.09592708
    float_data: 0.21531825
    float_data: -0.07673476
    float_data: 0.08723207
    float_data: 0.0183342
    float_data: 0.2189803
    float_data: -0.08082983
    float_data: -0.083972186
    float_data: -0.059939265
    float_data: -0.21238957
    float_data: -0.052575506
    float_data: -0.07591327
    float_data: 0.015039379
    float_data: 0.0341756
    float_data: 0.1876171
    float_data: 0.095042385
    float_data: -0.057690363
    float_data: -0.08984147
    float_data: 0.04919192
    float_data: -0.13202332
    float_data: 0.18314588
    float_data: 0.11794402
    float_data: -0.04691757
    float_data: -0.17131345
    float_data: 0.13538724
    float_data: -0.011453985
    float_data: 0.12378164
    float_data: -0.15944277
    float_data: -0.059937503
    float_data: 0.00052436994
    float_data: 0.0046980595
    float_data: -0.045006547
    float_data: 0.062284995
    float_data: -0.106762044
    float_data: -0.014237948
    float_data: 0.012029563
    float_data: 0.051443882
    float_data: 0.07116149
    float_data: -0.11246421
    float_data: -0.15341142
    float_data: 0.12776768
    float_data: 0.033231404
    float_data: -0.07484865
    float_data: 0.1551152
    float_data: 0.011567464
    float_data: 0.11792972
    float_data: 0.006751848
    float_data: 0.20607479
    float_data: 0.17553408
    float_data: -0.024896415
    float_data: 0.0971571
    float_data: 0.0645376
    float_data: 0.13686316
    float_data: -0.09649234
    float_data: 0.06860515
    float_data: 0.10584245
    float_data: -0.17587395
    float_data: -0.11832585
    float_data: -0.20392323
    float_data: -0.026940683
    float_data: 0.071754225
    float_data: 0.1502357
    float_data: 0.007409478
    float_data: 0.16286156
    float_data: -0.13801014
    float_data: -0.17033826
    float_data: -0.00555477
    float_data: 0.038406547
    float_data: -0.003269475
    float_data: -0.20674422
    float_data: -0.008912004
    float_data: -0.13044696
    float_data: 0.06696726
    float_data: 0.036659826
    float_data: -0.09398798
    float_data: -0.05138669
    float_data: -0.10592135
    float_data: -0.00626791
    float_data: 0.09551423
    float_data: -0.098572604
    float_data: 0.05040465
    float_data: -0.053025763
    float_data: -0.07928728
    float_data: -0.010703037
    float_data: -0.10352423
    float_data: -0.055364933
    float_data: -0.11978779
    float_data: 0.19647251
    float_data: 0.0035263554
    float_data: -0.06997255
    float_data: 0.021397991
    float_data: -0.011232805
    float_data: -0.02209696
    float_data: 0.061416667
    float_data: 0.07575077
    float_data: -0.053050112
    float_data: -0.057581823
    float_data: -0.027505169
    float_data: -0.23019211
    float_data: -0.1515191
    float_data: 0.13668743
    float_data: 0.16449676
    float_data: -0.024903605
    float_data: 0.0576557
    float_data: 0.031125015
    float_data: 0.3078881
    float_data: 0.11195749
    float_data: -0.012791759
    float_data: -0.09555405
    float_data: -0.16064464
    float_data: 0.020346364
    float_data: -0.075635076
    float_data: -0.14222537
    float_data: -0.06465729
    float_data: -0.108154796
    float_data: 0.16871417
    float_data: 0.08816398
    float_data: -0.0007972641
    float_data: 0.14799441
    float_data: 0.0077368305
    float_data: -0.08612842
    float_data: 0.15231241
    float_data: 0.053891003
    float_data: -0.103724614
    float_data: -0.019033868
    float_data: -0.08756183
    float_data: -0.13827997
    float_data: 0.09261776
    float_data: 0.19094168
    float_data: -0.13985676
    float_data: 0.056296922
    float_data: -0.06506426
    float_data: -0.04871254
    float_data: -0.059239395
    float_data: -0.08639908
    float_data: 0.0048521627
    float_data: -0.083095014
    float_data: 0.027045682
    float_data: -0.005023811
    float_data: -0.023894805
    float_data: -0.09075637
    float_data: -0.05767713
    float_data: 0.07553913
    float_data: 0.05009172
    float_data: -0.09775552
    float_data: 0.0099332305
    float_data: 0.07513871
    float_data: -0.16694053
    float_data: 0.05433602
    float_data: -0.06626238
    float_data: 0.057059865
    float_data: -0.076325916
    float_data: -0.18048821
    float_data: -0.16275425
    float_data: 0.004808495
    float_data: 0.02597225
    float_data: -0.09043166
    float_data: 0.06385925
    float_data: -0.166152
    float_data: -0.0066079795
    float_data: -0.12110162
    float_data: -0.06518361
    float_data: 0.004739867
    float_data: -0.08604134
    float_data: -0.038455557
    float_data: 0.100629285
    float_data: -0.05768919
    float_data: 0.083569214
    float_data: -0.11297069
    float_data: 0.05298042
    float_data: 0.14415686
    float_data: -0.24716444
    float_data: -0.079689525
    float_data: 0.057707217
    float_data: -0.020304538
    float_data: 0.037114587
    float_data: -0.06039852
    float_data: 0.008658979
    float_data: -0.015567723
    float_data: 0.11677821
    float_data: 0.025442084
    float_data: 0.03376027
    float_data: -0.0411877
    float_data: -0.048760623
    float_data: -0.043255817
    float_data: 0.039445218
    float_data: -0.042098448
    float_data: 0.028977487
    float_data: 0.20754008
    float_data: 0.08711247
    float_data: -0.03260235
    float_data: 0.1201214
    float_data: -0.040807538
    float_data: -0.20381247
    float_data: -0.100808635
    float_data: -0.18707919
    float_data: -0.035151348
    float_data: 0.0018418379
    float_data: 0.16764373
    float_data: 0.032692738
    float_data: -0.021910055
    float_data: 0.08294056
    float_data: -0.22111355
    float_data: 0.023561455
    float_data: 0.07708652
    float_data: -0.14785862
    float_data: 0.114375405
    float_data: 0.03384964
    float_data: -0.04152879
    float_data: 0.06327819
    float_data: 0.22706929
    float_data: 0.018186627
    float_data: 0.02482206
    float_data: -0.04593609
    float_data: -0.084984444
    float_data: 0.083033584
    float_data: -0.085608386
    float_data: 0.007156624
    float_data: -0.047765743
    float_data: 0.047897983
    float_data: 0.03336621
    float_data: 0.103754
    float_data: -0.05100164
    float_data: -0.026987493
    float_data: -0.09787637
    float_data: -0.04442933
    float_data: 0.03773005
    float_data: 0.07569887
    float_data: -0.09221654
    float_data: 0.08696059
    float_data: 0.13556379
    float_data: 0.04134349
    float_data: 0.18767957
    float_data: -0.07737892
    float_data: -0.124465466
    float_data: -0.17787203
    float_data: 0.14960442
    float_data: 0.065436564
    float_data: -0.005558467
    float_data: 0.027996862
    float_data: -0.1125489
    float_data: 0.24457519
    float_data: 0.012922118
    float_data: 0.01093948
    float_data: 0.072576664
    float_data: 0.048100926
    float_data: 0.022388404
    float_data: -0.07904745
    float_data: 0.04714684
    float_data: 0.18820246
    float_data: 0.134542
    float_data: 0.15931867
    float_data: -0.05112157
    float_data: -0.09896048
    float_data: -0.012578691
    float_data: 0.0055724913
    float_data: 0.10941916
    float_data: -0.16924646
    float_data: 0.15295504
    float_data: -0.01580079
    float_data: -0.04268811
    float_data: -0.10121044
    float_data: -0.16548567
    float_data: 0.08231706
    float_data: 0.007331797
    float_data: -0.12899609
    float_data: -0.12950788
    float_data: -0.03357847
    float_data: 0.16690215
    float_data: -0.025959134
    float_data: -0.1503143
    float_data: -0.024574308
    float_data: -0.027272357
    float_data: -0.26968867
    float_data: -0.0054294867
    float_data: -0.023093453
    float_data: 0.06962064
    float_data: 0.18489562
    float_data: 0.1126565
    float_data: -0.026888868
    float_data: -0.11065259
    float_data: 0.257336
    float_data: 0.0059218435
    float_data: 0.0013929292
    float_data: -0.002412509
    float_data: 0.019808477
    float_data: -0.014436041
    float_data: -0.0573662
    float_data: -0.054685898
    float_data: -0.0032753272
    float_data: -0.05434248
    float_data: -0.071284585
    float_data: 0.010643023
    float_data: -0.025497723
    float_data: 0.15039931
    float_data: -0.265097
    float_data: 0.109150685
    float_data: 0.12460852
    float_data: -0.20733903
    float_data: -0.034268763
    float_data: -0.037144087
    float_data: -0.14075117
    float_data: -0.07778167
    float_data: -0.11105758
    float_data: 0.17522705
    float_data: 0.09356784
    float_data: 0.12715551
    float_data: 0.07216721
    float_data: -0.11290518
    float_data: -0.052452028
    float_data: 0.048937455
    float_data: -0.12221278
    float_data: 0.07129984
    float_data: -0.024032539
    float_data: -0.03748208
    float_data: 0.071095996
    float_data: 0.044426333
    float_data: -0.036096618
    float_data: 0.11593298
    float_data: -0.10810633
    float_data: 0.061593562
    float_data: 0.059310127
    float_data: -0.030954644
    float_data: 0.032613304
    float_data: -0.12511136
    float_data: 0.092402704
    float_data: -0.018490214
    float_data: -0.0522723
    float_data: 0.10490092
    float_data: -0.07043437
    float_data: -0.14084613
    float_data: -0.15566292
    float_data: 0.060600996
    float_data: -0.12804294
    float_data: 0.17547943
    float_data: -0.20819294
    float_data: 0.16964564
    float_data: 0.021101749
    float_data: -0.009671311
    float_data: -0.054491907
    float_data: 0.039913613
    float_data: -0.0037634706
    float_data: 0.11033019
    float_data: 0.0114227645
    float_data: 0.015030175
    float_data: -0.03636122
    float_data: -0.005694562
    float_data: 0.03078018
    float_data: -0.17101684
    float_data: -0.13481854
    float_data: 0.07432641
    float_data: 0.017086543
    float_data: -0.018398335
    float_data: 0.0018433932
    float_data: 0.034758173
    float_data: -0.05397597
    float_data: -0.07783047
    float_data: 0.019584527
    float_data: -0.09783728
    float_data: 0.040825274
    float_data: -0.17025836
    float_data: 0.10291556
    float_data: 0.047259748
    float_data: 0.025602972
    float_data: 0.0982691
    float_data: 0.16654745
    float_data: 0.10143701
    float_data: -0.18408743
    float_data: -0.1279577
    float_data: -0.062481858
    float_data: 0.002609105
    float_data: 0.0517659
    float_data: -0.072574385
    float_data: 0.018676676
    float_data: -0.0755383
    float_data: -0.06115178
    float_data: -0.14066611
    float_data: -0.092323326
    float_data: -0.13516846
    float_data: -0.097587325
    float_data: 0.10536418
    float_data: -0.09493989
    float_data: 0.26323822
    float_data: 0.04933179
    float_data: 0.018483613
    float_data: -0.08583578
    float_data: 0.07003099
    float_data: -0.05756378
    float_data: 0.012200981
    float_data: 0.25600848
    float_data: -0.00960599
    float_data: 0.11492733
    float_data: -0.07031765
    float_data: -0.003498849
    float_data: 0.17708007
    float_data: -0.06269671
    float_data: 0.18124485
    float_data: 0.070775196
    float_data: -0.05624668
    float_data: 0.063240774
    float_data: 0.097255446
    float_data: 0.062180996
    float_data: -0.15702248
    float_data: -0.07271372
    float_data: -0.024751863
    float_data: -0.0074433433
    float_data: 0.06206721
    float_data: 0.0177701
    float_data: -0.13353443
    float_data: 0.038019788
    float_data: 0.061058577
    float_data: 0.055979043
    float_data: 0.10807808
    float_data: 0.08339222
    float_data: 0.04591801
    float_data: -0.007016571
    float_data: -0.16609609
    float_data: 0.04296182
    float_data: 0.02076877
    float_data: 0.027157886
    float_data: -0.12767486
    float_data: -0.10810566
    float_data: 0.10531528
    float_data: -0.0039555156
    float_data: 0.068150066
    float_data: 0.0028318376
    float_data: 0.002975614
    float_data: 0.09382838
    float_data: -0.051604476
    float_data: 0.009612078
    float_data: -0.04622753
    float_data: -0.04344962
    float_data: -0.030917212
    float_data: 0.022213377
    float_data: -0.047874864
    float_data: 0.12557562
    float_data: -0.08946073
    float_data: -0.018687164
    float_data: -0.043973107
    float_data: 0.14469779
    float_data: 0.01965548
    float_data: 0.103184454
    float_data: -0.14855604
    float_data: 0.026705027
    float_data: 0.088963084
    float_data: 0.008228399
    float_data: 0.10654803
    float_data: -0.051728845
    float_data: 0.14093475
    float_data: 0.22988982
    float_data: -0.036283858
    float_data: -0.04455025
    float_data: 0.14533846
    float_data: 0.15795723
    float_data: -0.052286007
    float_data: -0.04201868
    float_data: -0.028178459
    float_data: -0.13444506
    float_data: -0.0918652
    float_data: -0.100414075
    float_data: -0.07677976
    float_data: -0.003468489
    float_data: 0.023421474
    float_data: 0.15505005
    float_data: -0.0998354
    float_data: 0.098432235
    float_data: -0.021398885
    float_data: -0.004946371
    float_data: 0.06748195
    float_data: -0.1122722
    float_data: 0.038240977
    float_data: 0.016645221
    float_data: 0.049245127
    float_data: 0.028916866
    float_data: 0.24553001
    float_data: -0.063774
    float_data: -0.0530997
    float_data: -0.062314052
    float_data: -0.055547714
    float_data: -0.06373872
    float_data: 0.11890166
    float_data: 0.14205043
    float_data: -0.057074632
    float_data: -0.083235554
    float_data: 0.047141556
    float_data: -0.055222303
    float_data: 0.06329318
    float_data: 0.020292303
    float_data: -0.15157442
    float_data: 0.15475053
    float_data: 0.17958777
    float_data: -0.06127887
    float_data: -0.038770158
    float_data: 0.02858654
    float_data: 0.033445682
    float_data: 0.06585443
    float_data: 0.20102046
    float_data: -0.017694723
    float_data: -0.07982972
    float_data: -0.13793193
    float_data: -0.073093005
    float_data: -0.0033126974
    float_data: 0.17945579
    float_data: -0.05176113
    float_data: 0.022378795
    float_data: -0.0016422896
    float_data: 0.11883932
    float_data: 0.25269327
    float_data: -0.053086877
    float_data: -0.048943944
    float_data: 0.10441609
    float_data: 0.06818915
    float_data: 0.18467073
    float_data: 0.05839282
    float_data: -0.03592921
    float_data: 0.059065487
    float_data: 0.11087036
    float_data: 0.08204822
    float_data: 0.050727405
    float_data: 0.106667474
    float_data: 0.11692955
    float_data: 0.1382159
    float_data: 0.06487099
    float_data: -0.016711809
    float_data: 0.014671369
    float_data: 0.1206509
    float_data: -0.08169357
    float_data: 0.03686733
    float_data: -0.03933388
    float_data: 0.0028744822
    float_data: 0.1278452
    float_data: 0.019109907
    float_data: 0.004643655
    float_data: -0.13598561
    float_data: 0.07462536
    float_data: 0.064548425
    float_data: 0.21632548
    float_data: -0.030777825
    float_data: 0.021915033
    float_data: 0.02493837
    float_data: 0.15774533
    float_data: -0.009529553
    float_data: 0.027902154
    float_data: 0.060789652
    float_data: 0.018660912
    float_data: -0.04464336
    float_data: 0.019408999
    float_data: 0.10736318
    float_data: -0.10265153
    float_data: 0.013296968
    float_data: -0.070012085
    float_data: 0.11950467
    float_data: -0.1523187
    float_data: -0.055892188
    float_data: 0.037721187
    float_data: 0.1565524
    float_data: -0.0065750265
    float_data: -0.05551995
    float_data: 0.1881157
    float_data: -0.1448014
    float_data: -0.21988061
    float_data: 0.044001445
    float_data: -0.05020542
    float_data: -0.10212328
    float_data: 0.07083564
    float_data: 0.024380071
    float_data: -0.056407865
    float_data: -0.12803045
    float_data: 0.08724573
    float_data: 0.06502012
    float_data: -0.009917586
    float_data: 0.1846637
    float_data: -0.10700848
    float_data: -0.15255253
    float_data: -0.06919081
    float_data: -0.004558602
    float_data: 0.024333945
    float_data: -0.024123607
    float_data: 0.03520554
    float_data: -0.12515394
    float_data: 0.14437646
    float_data: -0.008215118
    float_data: 0.111729585
    float_data: 0.034272533
    float_data: 0.045675322
    float_data: 0.056976732
    float_data: 0.044770855
    float_data: 0.06427228
    float_data: 0.13291526
    float_data: 0.019652117
    float_data: 0.07090037
    float_data: -0.00897357
    float_data: 0.14401172
    float_data: -0.06763923
    float_data: 0.18009405
    float_data: -0.0040157954
    float_data: -0.14307751
    float_data: 0.012810442
    float_data: -0.06810517
    float_data: 0.08406436
    float_data: -0.0652624
    float_data: -0.044618346
    float_data: -0.18895407
    float_data: -0.045230635
    float_data: -0.24238794
    float_data: -0.15839028
    float_data: 0.07604147
    float_data: 0.078580014
    float_data: 0.04254576
    float_data: -0.09669762
    float_data: -0.0047711357
    float_data: -0.00036025394
    float_data: -0.115836464
    float_data: 0.15033983
    float_data: 0.087736234
    float_data: -0.022096418
    float_data: 0.002688584
    float_data: 0.020838281
    float_data: -0.20417349
    float_data: -0.024717739
    float_data: -0.06819843
    float_data: -0.10016201
    float_data: -0.028110031
    float_data: 0.17976867
    float_data: 0.064084284
    float_data: -0.057117898
    float_data: 0.057258278
    float_data: 0.13993554
    float_data: 0.09246337
    float_data: 0.0059630373
    float_data: -0.06469368
    float_data: 0.069822334
    float_data: 0.03934854
    float_data: 0.08951932
    float_data: 0.06351718
    float_data: 0.10495527
    float_data: -0.053523522
    float_data: 0.13173941
    float_data: 0.01975996
    float_data: 0.20752609
    float_data: -0.06891879
    float_data: 0.17359638
    float_data: 0.01979108
    float_data: -0.065141805
    float_data: -0.04838858
    float_data: -0.032034732
    float_data: 0.042416595
    float_data: 0.05228355
    float_data: -0.057370003
    float_data: -0.0024354593
    float_data: 0.21422704
    float_data: 0.17275432
    float_data: 0.04363237
    float_data: 0.003800348
    float_data: 0.012003133
    float_data: 0.061351802
    float_data: -0.10227926
    float_data: -0.025737656
    float_data: -0.16685842
    float_data: 0.039922312
    float_data: 0.064719595
    float_data: -0.048318647
    float_data: 0.15739869
    float_data: -0.12257657
    float_data: -0.1464375
    float_data: 0.022445183
    float_data: 0.10470983
    float_data: 0.16839276
    float_data: -0.045888428
    float_data: 0.10786809
    float_data: -0.0038508472
    float_data: -0.01726273
    float_data: 0.088365994
    float_data: 0.06523229
    float_data: -0.15763922
    float_data: 0.14765404
    float_data: 0.13800913
    float_data: -0.062556274
    float_data: 0.039580356
    float_data: 0.04940302
    float_data: 0.026067376
    float_data: -0.055030514
    float_data: -0.067162335
    float_data: -0.0025554071
    float_data: 0.117272906
    float_data: 0.054360013
    float_data: -0.037061434
    float_data: 0.07716987
    float_data: -0.28485426
    float_data: 0.11487657
    float_data: -0.17397138
    float_data: -0.036244094
    float_data: -0.11196699
    float_data: -0.12946814
    float_data: 0.11608268
    float_data: -0.046770122
    float_data: 0.03465039
    float_data: -0.004692058
    float_data: 0.047704082
    float_data: 0.0076821893
    float_data: -0.12829922
    float_data: 0.09962668
    float_data: -0.04937566
    float_data: -0.15565819
    float_data: -0.042811517
    float_data: 0.15007599
    float_data: 0.085022174
    float_data: -0.03486521
    float_data: -0.03492577
    float_data: -0.032163505
    float_data: 0.20767479
    float_data: 0.038193546
    float_data: 0.043004166
    float_data: 0.10302835
    float_data: 0.023878915
    float_data: -0.025904214
    float_data: -0.019634984
    float_data: -0.0071601258
    float_data: -0.0037222237
    float_data: 0.07276296
    float_data: 0.005194589
    float_data: 0.07326401
    float_data: -0.008071658
    float_data: 0.00786352
    float_data: -0.19982007
    float_data: 0.09163277
    float_data: 0.034648847
    float_data: 0.09980101
    float_data: -0.28962556
    float_data: 0.20883746
    float_data: -0.013958963
    float_data: 0.11081828
    float_data: -0.10399059
    float_data: 0.06127739
    float_data: -0.10534155
    float_data: -0.062376898
    float_data: 0.19140314
    float_data: -0.01906824
    float_data: 0.021743288
    float_data: 0.08700677
    float_data: 0.049568187
    float_data: 0.015041891
    float_data: 0.0364961
    float_data: 0.24034157
    float_data: -0.00576188
    float_data: 0.020109905
    float_data: 0.10506544
    float_data: 0.1105526
    float_data: 0.11870303
    float_data: 0.06387302
    float_data: -0.11430049
    float_data: 0.16334316
    float_data: -0.114634536
    float_data: 0.030263547
    float_data: -0.075427584
    float_data: -0.0064138346
    float_data: 0.032876242
    float_data: 0.03213572
    float_data: 0.042192075
    float_data: 0.16137113
    float_data: 0.04535343
    float_data: -0.024415663
    float_data: 0.09640872
    float_data: 0.11894705
    float_data: -0.12276079
    float_data: 0.059740007
    float_data: 0.07011728
    float_data: -0.02975635
    float_data: 0.13757068
    float_data: -0.015005559
    float_data: 0.012557645
    float_data: -0.017307183
    float_data: 0.0015579048
    float_data: -0.10962751
    float_data: -0.14400509
    float_data: 0.15945052
    float_data: -0.08469614
    float_data: -0.099139236
    float_data: -0.21533902
    float_data: -0.06389617
    float_data: -0.13230899
    float_data: 0.16420153
    float_data: 0.10098171
    float_data: -0.06881504
    float_data: 0.2252436
    float_data: 0.098176554
    float_data: -0.032483142
    float_data: -0.24994056
    float_data: 0.22909427
    float_data: -0.13895725
    float_data: -0.16453987
    float_data: 0.10225705
    float_data: 0.24397524
    float_data: 0.13842729
    float_data: 0.05639091
    float_data: 0.059475433
    float_data: 0.08534156
    float_data: 0.07589286
    float_data: 0.028119145
    float_data: 0.01042011
    float_data: -0.0062593124
    float_data: -0.07539646
    float_data: -0.028067509
    float_data: -0.16929568
    float_data: -0.009833963
    float_data: -0.09885912
    float_data: -0.11035893
    float_data: 0.017989416
    float_data: 0.13920024
    float_data: 0.09183166
    float_data: -0.15705006
    float_data: -0.09896281
    float_data: 0.09407712
    float_data: -0.09824874
    float_data: -0.022463316
    float_data: 0.05500521
    float_data: -0.09683444
    float_data: 0.010537551
    float_data: -0.13340256
    float_data: -0.060136765
    float_data: 0.031978194
    float_data: -0.15929937
    float_data: 0.044047475
    float_data: -0.00196378
    float_data: 0.055248994
    float_data: 0.022391414
    float_data: 0.13641404
    float_data: 0.012522451
    float_data: -0.042940553
    float_data: 0.012229751
    float_data: 0.0543298
    float_data: 0.004886007
    float_data: 0.004059169
    float_data: -0.07019917
    float_data: -0.066290095
    float_data: -0.14026053
    float_data: 0.17495768
    float_data: -0.124386325
    float_data: -0.06929052
    float_data: -0.071840726
    float_data: 0.08949244
    float_data: -0.02949497
    float_data: 0.12477421
    float_data: -0.06734907
    float_data: 0.027899418
    float_data: -0.08353471
    float_data: 0.21451493
    float_data: -0.11875985
    float_data: 0.030982072
    float_data: 0.06337769
    float_data: 0.04137991
    float_data: -0.018528765
    float_data: -0.01298207
    float_data: 0.004381147
    float_data: -0.0147001995
    float_data: 0.096387915
    float_data: 0.22105229
    float_data: -0.055749178
    float_data: -0.1369803
    float_data: -0.008828205
    float_data: 0.25797093
    float_data: -0.08036746
    float_data: 0.16391169
    float_data: 0.16777007
    float_data: -0.055358827
    float_data: 0.056898307
    float_data: 0.16283967
    float_data: -0.037912775
    float_data: -0.020358037
    float_data: -0.05816809
    float_data: -0.10147567
    float_data: -0.06492776
    float_data: -0.122394025
    float_data: 0.0034083468
    float_data: -0.076997325
    float_data: 0.023378592
    float_data: -0.15558957
    float_data: 0.033088025
    float_data: 0.08335289
    float_data: -0.19937357
    float_data: 0.03740566
    float_data: 0.122766905
    float_data: -0.1209641
    float_data: 0.16725723
    float_data: 0.0419019
    float_data: -0.070501186
    float_data: -0.005576908
    float_data: 0.05583269
    float_data: 0.0076005394
    float_data: 0.053875603
    float_data: -0.09206736
    float_data: 0.016936084
    float_data: -0.14137146
    float_data: -0.011122606
    float_data: -0.090390764
    float_data: -0.073552996
    float_data: 0.12360932
    float_data: 0.109131016
    float_data: 0.060913812
    float_data: -0.109231286
    float_data: -0.031640846
    float_data: 0.12130977
    float_data: 0.014171692
    float_data: 0.23193295
    float_data: 0.039331786
    float_data: 0.019204913
    float_data: -0.030911645
    float_data: 0.01335409
    float_data: -0.015246985
    float_data: 0.07081087
    float_data: 0.09567023
    float_data: -0.07859895
    float_data: -0.1331233
    float_data: -0.18362054
    float_data: 0.05079913
    float_data: -0.11033666
    float_data: -0.21528907
    float_data: 0.03885786
    float_data: 0.24929996
    float_data: -0.0006070912
    float_data: 0.08384908
    float_data: 0.008182936
    float_data: -0.009888966
    float_data: 0.09190765
    float_data: -0.029027453
    float_data: 0.02673923
    float_data: 0.03216978
    float_data: -0.06680905
    float_data: 0.099204235
    float_data: -0.017495977
    float_data: -0.07557452
    float_data: 0.053650986
    float_data: -0.0898468
    float_data: 0.0028181158
    float_data: -0.00091189967
    float_data: 0.10858955
    float_data: 0.047469825
    float_data: -0.002502696
    float_data: 0.081776634
    float_data: 0.13902076
    float_data: 0.055781033
    float_data: 0.001035262
    float_data: -0.13118362
    float_data: -0.10651137
    float_data: -0.030522471
    float_data: -0.06095122
    float_data: -0.018697131
    float_data: 0.0056649926
    float_data: 0.052969277
    float_data: -0.007049878
    float_data: 0.048650164
    float_data: 0.0064474414
    float_data: -0.19754666
    float_data: -0.093933545
    float_data: -0.014408755
    float_data: -0.120969474
    float_data: 0.059992876
    float_data: 0.15307508
    float_data: 0.12187618
    float_data: -0.021344287
    float_data: 0.14907262
    float_data: 0.014866746
    float_data: -0.0337086
    float_data: -0.06134027
    float_data: -0.030246971
    float_data: -0.038817685
    float_data: 0.017041622
    float_data: 0.016057398
    float_data: 0.00030460203
    float_data: 0.04369382
    float_data: 0.11906463
    float_data: 0.094955415
    float_data: -0.1484898
    float_data: -0.25539213
    float_data: 0.093431994
    float_data: -0.13668787
    float_data: -0.02247654
    float_data: -0.1170113
    float_data: -0.18019806
    float_data: 0.05414627
    float_data: 0.075915515
    float_data: -0.057651043
    float_data: -0.25910422
    float_data: -0.054624446
    float_data: 0.0391804
    float_data: -0.14789115
    float_data: 0.018335992
    float_data: -0.0015309849
    float_data: 0.057929154
    float_data: 0.011958037
    float_data: -0.0973069
    float_data: 0.11965715
    float_data: -0.015852958
    float_data: -0.002730454
    float_data: -0.0933268
    float_data: -0.044328224
    float_data: -0.08848027
    float_data: -0.017294606
    float_data: 0.17117085
    float_data: -0.13719012
    float_data: -0.16135614
    float_data: 0.14711703
    float_data: -0.020932367
    float_data: -0.06690728
    float_data: 0.10399047
    float_data: -0.060561556
    float_data: 0.18260098
    float_data: 0.06779259
    float_data: -0.04879114
    float_data: 0.21573082
    float_data: -0.06057149
    float_data: 0.07420953
    float_data: 0.02992926
    float_data: 0.13017413
    float_data: 0.15615112
    float_data: 0.0032004148
    float_data: -0.07534178
    float_data: 0.045997214
    float_data: -0.06777154
    float_data: 0.20133872
    float_data: 0.0136535335
    float_data: -0.036532156
    float_data: 0.018468032
    float_data: -0.13471262
    float_data: -0.097161405
    float_data: 0.12004139
    float_data: -0.06568943
    float_data: -0.1046911
    float_data: 0.053665277
    float_data: 0.11857041
    float_data: 0.07189533
    float_data: 0.09960477
    float_data: -0.07567951
    float_data: -0.14218107
    float_data: 0.15013336
    float_data: -0.032267984
    float_data: -0.025083302
    float_data: 0.13281941
    float_data: 0.055623002
    float_data: 0.045588776
    float_data: 0.21650024
    float_data: -0.06435182
    float_data: 0.09278401
    float_data: 0.0057013123
    float_data: 0.026859228
    float_data: 0.15284684
    float_data: 0.050783575
    float_data: 0.05382961
    float_data: 0.10725074
    float_data: -0.036495276
    float_data: -0.08392097
    float_data: -0.10448092
    float_data: -0.19663566
    float_data: 0.20562072
    float_data: -0.110320844
    float_data: -0.022125361
    float_data: -0.02768133
    float_data: 0.030740669
    float_data: 0.08157372
    float_data: 0.08604735
    float_data: -0.058307745
    float_data: -0.016712172
    float_data: 0.028257996
    float_data: -0.024869112
    float_data: 0.16073456
    float_data: 0.049097497
    float_data: 0.07348778
    float_data: 0.06628813
    float_data: 0.11734738
    float_data: 0.018102156
    float_data: -0.1296832
    float_data: 0.039968796
    float_data: -0.06513569
    float_data: -0.05286167
    float_data: 0.058636405
    float_data: 0.12382831
    float_data: 0.0021271578
    float_data: 0.030883301
    float_data: 0.1702215
    float_data: 0.024075318
    float_data: 0.2601683
    float_data: 0.05655096
    float_data: -0.17607628
    float_data: 0.07533416
    float_data: 0.03811584
    float_data: 0.12897527
    float_data: 0.067318134
    float_data: -0.013845599
    float_data: -0.122429825
    float_data: -0.020902326
    float_data: -0.08505204
    float_data: -0.058052342
    float_data: 0.05885784
    float_data: 0.16699044
    float_data: 0.039467152
    float_data: -0.11958831
    float_data: 0.044460267
    float_data: 0.11966314
    float_data: -0.06097829
    float_data: -0.013401717
    float_data: 0.0014688194
    float_data: -0.07848983
    float_data: 0.064828046
    float_data: -0.012094815
    float_data: 0.041953247
    float_data: -0.08874922
    float_data: -0.04374583
    float_data: 0.07223814
    float_data: -0.037283316
    float_data: 0.1726964
    float_data: -0.039963618
    float_data: 0.022468474
    float_data: 0.09325909
    float_data: -0.14183657
    float_data: -0.17608088
    float_data: -0.15256564
    float_data: 0.12625842
    float_data: -0.055185813
    float_data: 0.25581992
    float_data: -0.056424763
    float_data: 0.018455131
    float_data: 0.154211
    float_data: 0.20060928
    float_data: 0.20615037
    float_data: 0.12083663
    float_data: 0.102406256
    float_data: 0.059252698
    float_data: 0.07783611
    float_data: -0.055118572
    float_data: -0.081819884
    float_data: -0.00033744573
    float_data: -0.017018463
    float_data: -0.045322806
    float_data: 0.06963875
    float_data: 0.095530525
    float_data: 0.0088406885
    float_data: 0.14775302
    float_data: -0.114168905
    float_data: -0.019365946
    float_data: -0.07168224
    float_data: -0.18665366
    float_data: -0.008268069
    float_data: -0.012174751
    float_data: 0.15134498
    float_data: 0.06308117
    float_data: -0.10241868
    float_data: 0.18540926
    float_data: 0.12210337
    float_data: 0.058209773
    float_data: -0.02264841
    float_data: -0.09594392
    float_data: -0.03722068
    float_data: 0.10887486
    float_data: 0.18845864
    float_data: 0.15432435
    float_data: -0.048884943
    float_data: -0.111961745
    float_data: 0.014088625
    float_data: -0.17684394
    float_data: 0.03231677
    float_data: -0.014760259
    float_data: -0.04660365
    float_data: -0.1594703
    float_data: 0.05136001
    float_data: -0.053270083
    float_data: -0.11699169
    float_data: -0.28722623
    float_data: -0.0027514906
    float_data: 0.17722516
    float_data: 0.16612592
    float_data: -0.045709625
    float_data: -0.060221206
    float_data: 0.046877425
    float_data: -0.09983855
    float_data: 0.030179191
    float_data: 0.076608025
    float_data: 0.12269332
    float_data: -0.0100154085
    float_data: -0.020367375
    float_data: -0.08779826
    float_data: -0.08268803
    float_data: -0.02264789
    float_data: 0.03673655
    float_data: 0.09135847
    float_data: -0.0803179
    float_data: 0.14926885
    float_data: -0.02711236
    float_data: -0.0021367294
    float_data: -0.07472117
    float_data: -0.24242404
    float_data: 0.08840454
    float_data: 0.07368439
    float_data: -0.028132755
    float_data: 0.0066990717
    float_data: 0.051593926
    float_data: -0.15625459
    float_data: -0.05290527
    float_data: 0.07942647
    float_data: -0.12542894
    float_data: 0.029355794
    float_data: -0.13565819
    float_data: 0.046643
    float_data: -0.0035641484
    float_data: -0.1615132
    float_data: 0.116473936
    float_data: -0.07345916
    float_data: -0.08102524
    float_data: 0.02005692
    float_data: 0.11486373
    float_data: -0.101582184
    float_data: 0.006167985
    float_data: 0.04288165
    float_data: 0.06931056
    float_data: 0.017644156
    float_data: -0.036702786
    float_data: -0.08275902
    float_data: 0.008614388
    float_data: -0.10721391
    float_data: -0.29213506
    float_data: 0.04365598
    float_data: 0.09039348
    float_data: -0.23629324
    float_data: -0.10097307
    float_data: 0.061915427
    float_data: 0.20574954
    float_data: 0.002079371
    float_data: -0.0728003
    float_data: -0.018289644
    float_data: 0.13748764
    float_data: -0.06459642
    float_data: -0.079919204
    float_data: -0.048274353
    float_data: -0.09533286
    float_data: 0.012267032
    float_data: 0.16246785
    float_data: 0.03230793
    float_data: -0.02523535
    float_data: -0.029181127
    float_data: -0.15631908
    float_data: 0.08831098
    float_data: -0.00778372
    float_data: -0.018047992
    float_data: 0.31931075
    float_data: 0.029875292
    float_data: -0.07517911
    float_data: -0.04263576
    float_data: 0.114844576
    float_data: 0.011327041
    float_data: -0.1438278
    float_data: 0.091922894
    float_data: -0.066814415
    float_data: 0.18732978
    float_data: 0.10800481
    float_data: -0.04473219
    float_data: 0.12810163
    float_data: 0.0067855506
    float_data: 0.08527737
    float_data: 0.04847328
    float_data: -0.08463567
    float_data: -0.064354986
    float_data: 0.10299609
    float_data: -0.033477534
    float_data: -0.040364847
    float_data: -0.09551226
    float_data: 0.042359907
    float_data: 0.2062525
    float_data: -0.10675329
    float_data: 0.0024219458
    float_data: 0.14122206
    float_data: -0.00796414
    float_data: 0.04523718
    float_data: -0.106239356
    float_data: 0.04283071
    float_data: -0.018714426
    float_data: 0.098573
    float_data: 0.11873861
    float_data: 0.25895637
    float_data: 0.05796332
    float_data: 0.03257963
    float_data: 0.01943843
    float_data: -0.035316627
    float_data: 0.033848386
    float_data: -0.029540142
    float_data: 0.016846098
    float_data: 0.13175975
    float_data: -0.10065426
    float_data: 0.113987856
    float_data: 0.13171151
    float_data: -0.011806852
    float_data: -0.21218549
    float_data: -0.0607822
    float_data: 0.12969945
    float_data: -0.0022868062
    float_data: -0.09993022
    float_data: -0.050477494
    float_data: 0.084062
    float_data: 0.054673355
    float_data: -0.023893211
    float_data: -0.03668244
    float_data: -0.039175816
    float_data: -0.09224102
    float_data: 0.16153757
    float_data: -0.032232046
    float_data: 0.12171586
    float_data: 0.1521316
    float_data: 0.0998311
    float_data: -0.04316203
    float_data: 0.04037301
    float_data: -0.0024195607
    float_data: -0.090370186
    float_data: 0.032435928
    float_data: -0.117903985
    float_data: 0.11876794
    float_data: -0.04646173
    float_data: 0.020115966
    float_data: 0.02832879
    float_data: -0.025890497
    float_data: 0.058669385
    float_data: -0.047490366
    float_data: 0.087129734
    float_data: -0.13459797
    float_data: 0.012637958
    float_data: 0.1938929
    float_data: -0.10003313
    float_data: -0.0677745
    float_data: 0.051390786
    float_data: 0.017958177
    float_data: 0.03506301
    float_data: 0.048918713
    float_data: 0.063472144
    float_data: 0.11096998
    float_data: 0.040981866
    float_data: -0.024125766
    float_data: 0.06725737
    float_data: 0.1899882
    float_data: -0.013263375
    float_data: -0.09745293
    float_data: 0.11070807
    float_data: -0.012038116
    float_data: -0.21726696
    float_data: 0.08474217
    float_data: -0.05353282
    float_data: -0.009053328
    float_data: 0.033198033
    float_data: 0.019049969
    float_data: 0.07094518
    float_data: -0.04354864
    float_data: 0.05131058
    float_data: -0.025954667
    float_data: 0.07388105
    float_data: 0.061536748
    float_data: -0.09354387
    float_data: 0.10859821
    float_data: -0.053596344
    float_data: 0.08080578
    float_data: 0.036728732
    float_data: 0.18381837
    float_data: -0.022346599
    float_data: -0.034931682
    float_data: -0.0019419607
    float_data: -0.030317977
    float_data: 0.079994194
    float_data: -0.16163106
    float_data: -0.10536825
    float_data: -0.10678029
    float_data: 0.09503076
    float_data: 0.17106134
    float_data: -0.010444922
    float_data: -0.016882172
    float_data: 0.007005216
    float_data: 0.11618783
    float_data: -0.09273531
    float_data: 0.0238369
    float_data: 0.09751976
    float_data: 0.050109416
    float_data: 0.018958163
    float_data: 0.10010461
    float_data: -0.27032325
    float_data: 0.067787535
    float_data: -0.06540757
    float_data: -0.1830633
    float_data: 0.05112026
    float_data: 0.13736586
    float_data: -0.0137448525
    float_data: 0.09528746
    float_data: 0.16122782
    float_data: 0.13149145
    float_data: 0.16399646
    float_data: 0.07421275
    float_data: 0.007543364
    float_data: -0.16019659
    float_data: -0.024606248
    float_data: -0.08432466
    float_data: 0.21709429
    float_data: -0.017588582
    float_data: 0.01232048
    float_data: 0.05514854
    float_data: 0.004360245
    float_data: 0.1695051
    float_data: -0.062264938
    float_data: 0.019460745
    float_data: -0.074247055
    float_data: -0.13200225
