ir_version: 3
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "a"
    input: "b"
    output: "c"
    op_type: "MatMul"
  }
  name: "test_matmul_2d"
  input {
    name: "a"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "b"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "c"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
}
opset_import {
  version: 7
}
