ir_version: 3
producer_name: "ONNX Frontend test"
graph {
  node {
    input: "A"
    input: "B"
    output: "Y"
    name: "mul"
    op_type: "Mul"
  }
  name: "test_mul_bool"
  input {
    name: "A"
    type {
      tensor_type {
        elem_type: 9
        shape {
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "B"
    type {
      tensor_type {
        elem_type: 9
        shape {
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 9
        shape {
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  version: 7
}
