ir_version: 7
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "input"
    output: "output"
    op_type: "Multinomial"
    attribute {
      name: "sample_size"
      i: 5
      type: INT
    }
    attribute {
      name: "seed"
      f: 1.23
      type: FLOAT
    }
  }
  name: "test_multinomial"
  input {
    name: "input"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "output"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: -1
          }
          dim {
            dim_value: -1
          }
        }
      }
    }
  }
}
opset_import {
  version: 7
}
