ir_version: 8
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "x"
    input: "pads"
    input: ""
    input: "axes"
    output: "y"
    op_type: "Pad"
    attribute {
      name: "mode"
      s: "constant"
      type: STRING
    }
  }
  name: "test_pad_axes_out_of_range"
  initializer {
    dims: 2
    data_type: 7
    int64_data: 1
    int64_data: 1
    name: "pads"
  }
  initializer {
    dims: 1
    data_type: 7
    int64_data: -1000
    name: "axes"
  }
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: -1
          }
          dim {
            dim_value: -1
          }
        }
      }
    }
  }
}
opset_import {
  version: 18
}
