ir_version: 3
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    domain: "org.openvinotoolkit"
    input: "A"
    input: "B"
    output: "out"
    op_type: "PriorBoxClustered"
    attribute {
      name: "variance"
      floats: 0.1
      floats: 0.1
      floats: 0.2
      floats: 0.2
      type: FLOATS
    }
    attribute {
      name: "width"
      floats: 1.0
      type: FLOATS
    }
    attribute {
      name: "height"
      floats: 1.0
      type: FLOATS
    }
  }
  name: "compute_graph"
  input {
    name: "A"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "B"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "out"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
}
opset_import {
  version: 1
}
