ir_version: 7
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "x"
    input: "x_scale"
    input: "x_zero_point"
    output: "y"
    name: "node1"
    op_type: "QuantizeLinear"
  }
  name: "test"
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "x_scale"
    type {
      tensor_type {
        elem_type: 1
        shape{
        }
      }
    }
  }
  input {
    name: "x_zero_point"
    type {
      tensor_type {
        elem_type: 2
        shape {
        }
      }
    }
  }
  output {
    name: "y"
    type {
      tensor_type {
        elem_type: 2
        shape {
        }
      }
    }
  }
}
opset_import {
  version: 13
}
