ir_version: 3
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    output: "y"
    op_type: "RandomUniform"
    attribute {
      name: "shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "high"
      f: 50
      type: FLOAT
    }
    attribute {
      name: "low"
      f: 40
      type: FLOAT
    }
    attribute {
      name: "seed"
      f: 100
      type: FLOAT
    }
  }
  name: "test_model"
  output {
    name: "y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  version: 1
}
