ir_version: 3
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "data"
    output: "B"
    op_type: "ReduceSum"
  }
  name: "compute_graph"
  input {
    name: "data"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }

  output {
    name: "B"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
}
opset_import {
  version: 13
}
