ir_version: 4
producer_name: "nGraph ONNX Importer"
graph {
    node {
        input: "A"
        output: "B"
        op_type: "ReduceL2"
    }
    name: "compute_graph"
    input {
        name: "A"
        type {
            tensor_type {
                elem_type: 1
                shape {
                    dim {
                        dim_value: 1
                    }
                    dim {
                        dim_value: 1
                    }
                    dim {
                        dim_value: 4
                    }
                    dim {
                        dim_value: 4
                    }
                }
            }
        }
    }
    input {
    name: "axes"
    type {
      tensor_type {
        elem_type: 6
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
    output {
        name: "B"
        type {
            tensor_type {
                elem_type: 1
                shape {
                    dim {
                        dim_value: 1
                    }
                }
            }
        }
    }
}
opset_import {
    version: 18
}
