ir_version: 3
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "A"
    input: "axes"
    output: "B"
    op_type: "ReduceProd"
  }
  name: "compute_graph"
  initializer {
    data_type: 6
    dims: 1
    name: "axes"
    raw_data: "\002\000\000\000"
  }
  input {
    name: "A"
    type {
      tensor_type {
        elem_type: 2
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "axes"
    type {
      tensor_type {
        elem_type: 6
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  output {
    name: "B"
    type {
      tensor_type {
        elem_type: 2
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
}
opset_import {
  version: 18
}
