ir_version: 3
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    output: "axes"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 4
        data_type: 7
        int64_data: 0
        int64_data: 1
        int64_data: 2
        int64_data: 3
        name: "const_tensor"
      }
      type: TENSOR
    }
  }
  node {
    input: "data"
    input: "axes"
    output: "B"
    op_type: "ReduceSum"
  }
  name: "compute_graph"
  input {
    name: "data"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }

  output {
    name: "B"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
}
opset_import {
  version: 13
}
