ir_version: 3
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "A"
    output: "B"
    op_type: "Reshape"
    attribute {
      name: "shape"
      ints: 0
      ints: -1
      ints: 2
      type: INTS
    }
  }
  name: "compute_graph"
  input {
    name: "A"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "B"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 6
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  version: 1
}
