ir_version: 7
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    output: "shape_const"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 3
        data_type: 7
        int64_data: 3
        int64_data: 4
        int64_data: 0
        name: "shape_tensor"
      }
      type: TENSOR
    }
  }
  node {
    input: "data"
    input: "shape_const"
    output: "reshaped"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 1
      type: INT
    }
  }
  name: "test_reshape_allowzero"
  input {
    name: "data"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 0
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "reshaped"
    type {
      tensor_type {
        elem_type: 1
        shape {
        }
      }
    }
  }
}
opset_import {
  version: 14
}
