ir_version: 7
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    output: "sizes"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 4
        data_type: 7
        int64_data: 1
        int64_data: 1
        int64_data: 7
        int64_data: 8
        name: "const_tensor"
      }
      type: TENSOR
    }
  }
  node {
    input: "X"
    input: ""
    input: ""
    input: "sizes"
    output: "Y"
    op_type: "Resize"
  }
  name: "test-model"
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 7
          }
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 11
}

