ir_version: 7
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    output: "sizes"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 4
        data_type: 7
        int64_data: 1
        int64_data: 1
        int64_data: 3
        int64_data: 2
        name: "const_tensor"
      }
      type: TENSOR
    }
  }
  node {
    input: "X"
    input: ""
    input: ""
    input: "sizes"
    output: "Y"
    op_type: "Resize"
    attribute {
      name: "coordinate_transformation_mode"
      s: "tf_half_pixel_for_nn"
      type: STRING
    }
    attribute {
      name: "cubic_coeff_a"
      f: -0.75
      type: FLOAT
    }
    attribute {
      name: "exclude_outside"
      i: 0
      type: INT
    }
    attribute {
      name: "extrapolation_value"
      f: 0
      type: FLOAT
    }
    attribute {
      name: "mode"
      s: "nearest"
      type: STRING
    }
  }
  name: "test-model"
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 11
}

