ir_version: 11
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "X"
    input: "scale"
    output: "Y"
    op_type: "RMSNormalization"
    attribute {
      name: "axis"
      i: -1
      type: INT
    }
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
  }
  name: "rms_norm_graph"
  initializer {
    dims: 4
    data_type: 1
    name: "scale"
    raw_data: "\000\000\200?\000\000\200?\000\000\200?\000\000\200?"
  }
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 23
}
