
ir_version: 8
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "X"
    input: "rois"
    input: "batch_indices"
    output: "Y"
    op_type: "RoiAlign"
    attribute {
      name: "coordinate_transformation_mode"
      s: "output_half_pixel"
      type: STRING
    }
    attribute {
      name: "mode"
      s: "avg"
      type: STRING
    }
    attribute {
      name: "output_height"
      i: 4
      type: INT
    }
    attribute {
      name: "output_width"
      i: 4
      type: INT
    }
    attribute {
      name: "sampling_ratio"
      i: 3
      type: INT
    }
    attribute {
      name: "spatial_scale"
      f: 0.5
      type: FLOAT
    }
  }
  name: "test-model-roialign"
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 6
          }
          dim {
            dim_value: 6
          }
        }
      }
    }
  }
  input {
    name: "rois"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "batch_indices"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 16
}
