ir_version: 3
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "x"
    output: "y"
    op_type: "Round"
  }
  name: "test_round"
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 11
          }
        }
      }
    }
  }
  output {
    name: "y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 11
          }
        }
      }
    }
  }
}
opset_import {
  version: 11
}
