ir_version: 8
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "initial"
    input: "sequence"
    output: "scan_end"
    output: "scan_seq"
    op_type: "Scan"
    attribute {
      name: "body"
      g {
        node {
          input: "state"
          input: "seq_elem"
          output: "sum"
          op_type: "Add"
        }
        name: "body"
        input {
          name: "state"
          type {
            tensor_type {
              elem_type: 1
              shape {
              }
            }
          }
        }
        input {
          name: "seq_elem"
          type {
            tensor_type {
              elem_type: 1
              shape {
              }
            }
          }
        }
        output {
          name: "sum"
          type {
            tensor_type {
              elem_type: 1
              shape {
              }
            }
          }
        }
      }
      type: GRAPH
    }
    attribute {
      name: "num_scan_inputs"
      i: -5
      type: INT
    }
  }
  name: "test-model-scan-neg"
  input {
    name: "initial"
    type {
      tensor_type {
        elem_type: 1
        shape {
        }
      }
    }
  }
  input {
    name: "sequence"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  output {
    name: "scan_end"
    type {
      tensor_type {
        elem_type: 1
        shape {
        }
      }
    }
  }
  output {
    name: "scan_seq"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
}
opset_import {
  version: 15
}
