ir_version: 3
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "x"
    input: "i"
    input: "u"
    output: "y"
    op_type: "ScatterND"
  }
  name: "test_scatterND"
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
  initializer {
    dims: 4
    dims: 1
    data_type: 6
    int32_data: 4
    int32_data: 3
    int32_data: 1
    int32_data: 7
    name: "i"
  }
  input {
    name: "u"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 8
          }
        }
      }
    }
  }
}
opset_import {
  version: 7
}
