ir_version: 10
graph {
  node {
    input: "a"
    input: "b"
    input: "c"
    output: "seq"
    op_type: "SequenceConstruct"
  }
  node {
    input: "seq"
    output: "seq2"
    op_type: "SequenceErase"
  }
  node {
    input: "seq2"
    input: "pos_at"
    output: "output"
    op_type: "SequenceAt"
  }
  name: "sequence_erase_last"
  initializer {
    data_type: 7
    int64_data: 1
    name: "pos_at"
  }
  input {
    name: "a"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "b"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "c"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "output"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  version: 11
}
