ir_version: 7
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    output: "N"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 6
        int32_data: 2
        name: "const_tensor_N"
      }
      type: TENSOR
    }
  }
  node {
    input: "X"
    output: "A"
    op_type: "Relu"
  }
  node {
    input: "A"
    input: "N"
    output: "B"
    op_type: "Pow"
  }
  node {
    input: "B"
    output: "C"
    op_type: "Size"
  }
  node {
    input: "C"
    output: "D"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "D"
    output: "Y"
    op_type: "Relu"
  }
  name: "test-model"
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 1
        shape {
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 12
}
