ir_version: 11
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "X"
    output: "Y"
    name: "node1"
    op_type: "Softsign"
    doc_string: "Softsign"
    domain: ""
  }
  name: "test"
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 10
          }
        }
      }
    }
  }
  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 10
          }
        }
      }
    }
  }
}
opset_import {
  version: 1
}
