ir_version: 8
graph {
  node {
    output: "frame_step"
    name: "frame_step_const"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        int64_data: 8
        name: "frame_step_tensor"
      }
      type: TENSOR
    }
  }
  node {
    output: "frame_length"
    name: "frame_length_const"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        int64_data: 24
        name: "frame_length_tensor"
      }
      type: TENSOR
    }
  }
  node {
    input: "signal"
    input: "frame_step"
    input: ""
    input: "frame_length"
    output: "Y"
    op_type: "STFT"
    attribute {
      name: "onesided"
      i: 0
      type: INT
    }
  }
  input {
    name: "signal"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 32
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
          }
          dim {
          }
          dim {
          }
          dim {
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 17
}
