ir_version: 10
producer_name: "OpenVINO ONNX Frontend"
graph {
  name: "test"
  node {
    output: "Y"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 4
        data_type: 21
        int32_data: 16
        int32_data: 248
        name: "uint4_const"
      }
      type: TENSOR
    }
  }
  node {
    input: "Y"
    output: "O"
    op_type: "Shape"
  }
  output {
    name: "O"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
}
opset_import {
  version: 21
}
