ir_version: 7
graph {
  node {
    input: "data"
    output: "unique"
    output: "unique_idx"
    output: "unique_rev_idx"
    output: "unique_counts"
    op_type: "Unique"
  }
  input {
    name: "data"
    type {
      tensor_type {
        elem_type: 6
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "unique"
    type {
      tensor_type {
        elem_type: 6
        shape {
        }
      }
    }
  }
  output {
    name: "unique_idx"
    type {
      tensor_type {
        elem_type: 7
        shape {
        }
      }
    }
  }
  output {
    name: "unique_rev_idx"
    type {
      tensor_type {
        elem_type: 7
        shape {
        }
      }
    }
  }
  output {
    name: "unique_counts"
    type {
      tensor_type {
        elem_type: 7
        shape {
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 13
}
