ir_version: 4
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "A"
    input: "B"
    output: "C"
    op_type: "Add"
  }
  name: "compute_graph"
  input {
    name: "A"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "B"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "C"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  domain: "unknown.domain"
  version: 1
}
opset_import {
  domain: ""
  version: 7
}
