<?xml version="1.0" ?>
<net name="if_diff_case" version="10">
	<layers>
		<layer id="0" name="x" type="Parameter" version="opset1">
			<data element_type="f32" shape="2,4"/>
			<output>
				<port id="0" names="Func/PartitionedCall/input/_0:0,x:0" precision="FP32">
					<dim>2</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="w" type="Parameter" version="opset1">
			<data element_type="f32" shape="2,4"/>
			<output>
				<port id="0" names="Func/PartitionedCall/input/_3:0,w:0" precision="FP32">
					<dim>2</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="PartitionedCall/model/if/Less" type="Less" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>2</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="PartitionedCall/model/if/Less:0" precision="BOOL">
					<dim>2</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="PartitionedCall/model/if/Const" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="2" size="16"/>
			<output>
				<port id="0" names="PartitionedCall/model/if/Const:0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="PartitionedCall/model/if/All" type="ReduceLogicalAnd" version="opset1">
			<data keep_dims="false"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="PartitionedCall/model/if/All:0" precision="BOOL"/>
			</output>
		</layer>
		<layer id="5" name="y" type="Parameter" version="opset1">
			<data element_type="f32" shape="2,4"/>
			<output>
				<port id="0" names="Func/PartitionedCall/input/_1:0,y:0" precision="FP32">
					<dim>2</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="z" type="Parameter" version="opset1">
			<data element_type="f32" shape="2,4"/>
			<output>
				<port id="0" names="Func/PartitionedCall/input/_2:0,z:0" precision="FP32">
					<dim>2</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="PartitionedCall/model/if/cond" type="If" version="opset8">
			<input>
				<port id="0"/>
				<port id="1">
					<dim>2</dim>
					<dim>4</dim>
				</port>
				<port id="2">
					<dim>2</dim>
					<dim>4</dim>
				</port>
				<port id="3">
					<dim>2</dim>
					<dim>4</dim>
				</port>
				<port id="4">
					<dim>2</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="5" names="PartitionedCall/model/if/cond/Identity:0,PartitionedCall/model/if/cond:0" precision="FP32">
					<dim>2</dim>
					<dim>4</dim>
				</port>
				<port id="6" names="PartitionedCall/model/if/cond/Identity_1:0,PartitionedCall/model/if/cond:1" precision="FP32">
					<dim>2</dim>
					<dim>4</dim>
				</port>
			</output>
			<then_port_map>
				<input external_port_id="1" internal_layer_id="0"/>
				<input external_port_id="2" internal_layer_id="1"/>
				<input external_port_id="3" internal_layer_id="4"/>
				<output external_port_id="1" internal_layer_id="6"/>
				<output external_port_id="0" internal_layer_id="3"/>
			</then_port_map>
			<else_port_map>
				<input external_port_id="2" internal_layer_id="1"/>
				<input external_port_id="3" internal_layer_id="0"/>
				<input external_port_id="4" internal_layer_id="2"/>
				<output external_port_id="0" internal_layer_id="5"/>
				<output external_port_id="1" internal_layer_id="7"/>
			</else_port_map>
			<then_body>
				<layers>
					<layer id="0" name="add_x" type="Parameter" version="opset1">
						<data element_type="f32" shape="2,4"/>
						<output>
							<port id="0" names="add_x:0" precision="FP32">
								<dim>2</dim>
								<dim>4</dim>
							</port>
						</output>
					</layer>
					<layer id="1" name="add_w" type="Parameter" version="opset1">
						<data element_type="f32" shape="2,4"/>
						<output>
							<port id="0" names="add_w:0" precision="FP32">
								<dim>2</dim>
								<dim>4</dim>
							</port>
						</output>
					</layer>
					<layer id="2" name="Add" type="Add" version="opset1">
						<data auto_broadcast="numpy"/>
						<input>
							<port id="0">
								<dim>2</dim>
								<dim>4</dim>
							</port>
							<port id="1">
								<dim>2</dim>
								<dim>4</dim>
							</port>
						</input>
						<output>
							<port id="2" names="Add:0" precision="FP32">
								<dim>2</dim>
								<dim>4</dim>
							</port>
						</output>
					</layer>
					<layer id="3" name="Identity/sink_port_0" type="Result" version="opset1">
						<input>
							<port id="0">
								<dim>2</dim>
								<dim>4</dim>
							</port>
						</input>
					</layer>
					<layer id="4" name="add_1_y" type="Parameter" version="opset1">
						<data element_type="f32" shape="2,4"/>
						<output>
							<port id="0" names="add_1_y:0" precision="FP32">
								<dim>2</dim>
								<dim>4</dim>
							</port>
						</output>
					</layer>
					<layer id="5" name="Add_1" type="Add" version="opset1">
						<data auto_broadcast="numpy"/>
						<input>
							<port id="0">
								<dim>2</dim>
								<dim>4</dim>
							</port>
							<port id="1">
								<dim>2</dim>
								<dim>4</dim>
							</port>
						</input>
						<output>
							<port id="2" names="Add_1:0" precision="FP32">
								<dim>2</dim>
								<dim>4</dim>
							</port>
						</output>
					</layer>
					<layer id="6" name="Identity_1/sink_port_0" type="Result" version="opset1">
						<input>
							<port id="0">
								<dim>2</dim>
								<dim>4</dim>
							</port>
						</input>
					</layer>
				</layers>
				<edges>
					<edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
					<edge from-layer="1" from-port="0" to-layer="2" to-port="1"/>
					<edge from-layer="2" from-port="2" to-layer="3" to-port="0"/>
					<edge from-layer="0" from-port="0" to-layer="5" to-port="0"/>
					<edge from-layer="4" from-port="0" to-layer="5" to-port="1"/>
					<edge from-layer="5" from-port="2" to-layer="6" to-port="0"/>
				</edges>
			</then_body>
			<else_body>
				<layers>
					<layer id="0" name="add_y" type="Parameter" version="opset1">
						<data element_type="f32" shape="2,4"/>
						<output>
							<port id="0" names="add_y:0" precision="FP32">
								<dim>2</dim>
								<dim>4</dim>
							</port>
						</output>
					</layer>
					<layer id="1" name="mul_w" type="Parameter" version="opset1">
						<data element_type="f32" shape="2,4"/>
						<output>
							<port id="0" names="mul_w:0" precision="FP32">
								<dim>2</dim>
								<dim>4</dim>
							</port>
						</output>
					</layer>
					<layer id="2" name="mul_z" type="Parameter" version="opset1">
						<data element_type="f32" shape="2,4"/>
						<output>
							<port id="0" names="mul_z:0" precision="FP32">
								<dim>2</dim>
								<dim>4</dim>
							</port>
						</output>
					</layer>
					<layer id="3" name="Mul" type="Multiply" version="opset1">
						<data auto_broadcast="numpy"/>
						<input>
							<port id="0">
								<dim>2</dim>
								<dim>4</dim>
							</port>
							<port id="1">
								<dim>2</dim>
								<dim>4</dim>
							</port>
						</input>
						<output>
							<port id="2" names="Mul:0" precision="FP32">
								<dim>2</dim>
								<dim>4</dim>
							</port>
						</output>
					</layer>
					<layer id="4" name="Add" type="Add" version="opset1">
						<data auto_broadcast="numpy"/>
						<input>
							<port id="0">
								<dim>2</dim>
								<dim>4</dim>
							</port>
							<port id="1">
								<dim>2</dim>
								<dim>4</dim>
							</port>
						</input>
						<output>
							<port id="2" names="Add:0" precision="FP32">
								<dim>2</dim>
								<dim>4</dim>
							</port>
						</output>
					</layer>
					<layer id="5" name="Identity/sink_port_0" type="Result" version="opset1">
						<input>
							<port id="0">
								<dim>2</dim>
								<dim>4</dim>
							</port>
						</input>
					</layer>
					<layer id="6" name="Add_1" type="Add" version="opset1">
						<data auto_broadcast="numpy"/>
						<input>
							<port id="0">
								<dim>2</dim>
								<dim>4</dim>
							</port>
							<port id="1">
								<dim>2</dim>
								<dim>4</dim>
							</port>
						</input>
						<output>
							<port id="2" names="Add_1:0" precision="FP32">
								<dim>2</dim>
								<dim>4</dim>
							</port>
						</output>
					</layer>
					<layer id="7" name="Identity_1/sink_port_0" type="Result" version="opset1">
						<input>
							<port id="0">
								<dim>2</dim>
								<dim>4</dim>
							</port>
						</input>
					</layer>
				</layers>
				<edges>
					<edge from-layer="1" from-port="0" to-layer="3" to-port="0"/>
					<edge from-layer="2" from-port="0" to-layer="3" to-port="1"/>
					<edge from-layer="0" from-port="0" to-layer="4" to-port="0"/>
					<edge from-layer="3" from-port="2" to-layer="4" to-port="1"/>
					<edge from-layer="4" from-port="2" to-layer="5" to-port="0"/>
					<edge from-layer="2" from-port="0" to-layer="6" to-port="0"/>
					<edge from-layer="1" from-port="0" to-layer="6" to-port="1"/>
					<edge from-layer="6" from-port="2" to-layer="7" to-port="0"/>
				</edges>
			</else_body>
		</layer>
		<layer id="8" name="PartitionedCall/model/if/Relu_1" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" names="Func/PartitionedCall/output/_5:0,Identity_1:0,PartitionedCall/Identity_1:0,PartitionedCall/model/if/Relu_1:0" precision="FP32">
					<dim>2</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Func/PartitionedCall/output/_5:0" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>4</dim>
				</port>
			</input>
		</layer>
		<layer id="10" name="PartitionedCall/model/if/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" names="Func/PartitionedCall/output/_4:0,Identity:0,PartitionedCall/Identity:0,PartitionedCall/model/if/Relu:0" precision="FP32">
					<dim>2</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Func/PartitionedCall/output/_4:0" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>4</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
		<edge from-layer="1" from-port="0" to-layer="2" to-port="1"/>
		<edge from-layer="2" from-port="2" to-layer="4" to-port="0"/>
		<edge from-layer="3" from-port="0" to-layer="4" to-port="1"/>
		<edge from-layer="4" from-port="2" to-layer="7" to-port="0"/>
		<edge from-layer="0" from-port="0" to-layer="7" to-port="1"/>
		<edge from-layer="1" from-port="0" to-layer="7" to-port="2"/>
		<edge from-layer="5" from-port="0" to-layer="7" to-port="3"/>
		<edge from-layer="6" from-port="0" to-layer="7" to-port="4"/>
		<edge from-layer="7" from-port="6" to-layer="8" to-port="0"/>
		<edge from-layer="8" from-port="1" to-layer="9" to-port="0"/>
		<edge from-layer="7" from-port="5" to-layer="10" to-port="0"/>
		<edge from-layer="10" from-port="1" to-layer="11" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="custom_mo/if_e1c378603739261e2f0e7334708eb6cf0b3c8ed1"/>
		<cli_parameters>
			<caffe_parser_path value="DIR"/>
			<data_type value="FP32"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_omitting_optional value="False"/>
			<disable_resnet_optimization value="False"/>
			<disable_weights_compression value="False"/>
			<enable_concat_optimization value="False"/>
			<enable_flattening_nested_params value="False"/>
			<enable_ssd_gluoncv value="False"/>
			<extensions value="DIR"/>
			<framework value="tf"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_deprecated_IR_V7 value="False"/>
			<input value="x,y,z,w"/>
			<input_model_is_text value="False"/>
			<input_shape value="(2,4),(2,4),(2,4),(2,4)"/>
			<k value="DIR\CustomLayersMapping.xml"/>
			<keep_shape_ops value="True"/>
			<legacy_ir_generation value="False"/>
			<legacy_mxnet_model value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<model_name value="if_diff_case"/>
			<output_dir value="DIR"/>
			<placeholder_data_types value="{}"/>
			<placeholder_shapes value="{'x': array([2, 4], dtype=int64), 'y': array([2, 4], dtype=int64), 'z': array([2, 4], dtype=int64), 'w': array([2, 4], dtype=int64)}"/>
			<progress value="False"/>
			<remove_memory value="False"/>
			<remove_output_softmax value="False"/>
			<reverse_input_channels value="False"/>
			<save_params_from_nd value="False"/>
			<saved_model_dir value="DIR"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<static_shape value="False"/>
			<stream_output value="False"/>
			<transform value=""/>
			<unset unset_cli_parameters="batch, counts, disable_fusing, disable_gfusing, finegrain_fusing, input_checkpoint, input_meta_graph, input_model, input_proto, input_symbol, mean_file, mean_file_offsets, move_to_preprocess, nd_prefix_name, output, pretrained_model_name, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_use_custom_operations_config, transformations_config"/>
		</cli_parameters>
	</meta_data>
</net>
