ir_version: 7
producer_name: "OpenVINO ONNX Frontend"
graph {
  name: "if_with_initializer_output"
  node {
    input: "condition"
    output: "result"
    name: "if_node"
    op_type: "If"
    attribute {
      name: "then_branch"
      type: GRAPH
      g {
        name: "then_branch"
        node {
          input: "x"
          output: "then_out"
          name: "then_identity"
          op_type: "Identity"
        }
        output {
          name: "then_out"
          type {
            tensor_type {
              elem_type: 1
              shape {
                dim {
                  dim_value: 3
                }
              }
            }
          }
        }
      }
    }
    attribute {
      name: "else_branch"
      type: GRAPH
      g {
        name: "else_branch"
        initializer {
          dims: 3
          data_type: 1
          float_data: 0.0
          float_data: 0.0
          float_data: 0.0
          name: "else_const"
        }
        output {
          name: "else_const"
          type {
            tensor_type {
              elem_type: 1
              shape {
                dim {
                  dim_value: 3
                }
              }
            }
          }
        }
      }
    }
  }
  input {
    name: "condition"
    type {
      tensor_type {
        elem_type: 9
        shape {
        }
      }
    }
  }
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "result"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
}
opset_import {
  version: 14
}
