ir_version: 7
producer_name: "OpenVINO ONNX Frontend"
graph {
  name: "loop_with_initializer_output"
  node {
    input: "trip_count"
    input: "cond_in"
    input: "x_init"
    output: "x_final"
    name: "loop_node"
    op_type: "Loop"
    attribute {
      name: "body"
      type: GRAPH
      g {
        name: "loop_body"
        initializer {
          dims: 1
          data_type: 1
          float_data: 1.0
          name: "step"
        }
        node {
          input: "x_in"
          input: "step"
          output: "x_out"
          name: "add_step"
          op_type: "Add"
        }
        node {
          input: "cond_body_in"
          output: "cond_body_out"
          name: "cond_passthrough"
          op_type: "Identity"
        }
        input {
          name: "iter"
          type {
            tensor_type {
              elem_type: 7
              shape {
              }
            }
          }
        }
        input {
          name: "cond_body_in"
          type {
            tensor_type {
              elem_type: 9
              shape {
              }
            }
          }
        }
        input {
          name: "x_in"
          type {
            tensor_type {
              elem_type: 1
              shape {
                dim {
                  dim_value: 1
                }
              }
            }
          }
        }
        output {
          name: "cond_body_out"
          type {
            tensor_type {
              elem_type: 9
              shape {
              }
            }
          }
        }
        output {
          name: "x_out"
          type {
            tensor_type {
              elem_type: 1
              shape {
                dim {
                  dim_value: 1
                }
              }
            }
          }
        }
        output {
          name: "step"
          type {
            tensor_type {
              elem_type: 1
              shape {
                dim {
                  dim_value: 1
                }
              }
            }
          }
        }
      }
    }
  }
  input {
    name: "trip_count"
    type {
      tensor_type {
        elem_type: 7
        shape {
        }
      }
    }
  }
  input {
    name: "cond_in"
    type {
      tensor_type {
        elem_type: 9
        shape {
        }
      }
    }
  }
  input {
    name: "x_init"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  output {
    name: "x_final"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
}
opset_import {
  version: 14
}
