ir_version: 7
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "trip_count"
    input: "cond_init"
    input: "a_init"
    output: "a_final"
    op_type: "Loop"
    attribute {
      name: "body"
      g {
        node {
          input: "cond_in"
          output: "cond_out"
          op_type: "Identity"
        }
        node {
          input: "a_in"
          input: "step"
          output: "a_out"
          op_type: "Concat"
          attribute {
            name: "axis"
            i: 0
            type: INT
          }
        }
        name: "loop_body"
        initializer {
          dims: 1
          data_type: 1
          float_data: 2
          name: "step"
        }
        input {
          name: "i"
          type {
            tensor_type {
              elem_type: 7
              shape {
              }
            }
          }
        }
        input {
          name: "cond_in"
          type {
            tensor_type {
              elem_type: 9
              shape {
              }
            }
          }
        }
        input {
          name: "a_in"
          type {
            tensor_type {
              elem_type: 1
              shape {
                dim {
                }
              }
            }
          }
        }
        output {
          name: "cond_out"
          type {
            tensor_type {
              elem_type: 9
            }
          }
        }
        output {
          name: "a_out"
          type {
            tensor_type {
              elem_type: 1
            }
          }
        }
      }
      type: GRAPH
    }
  }
  initializer {
    dims: 1
    data_type: 7
    int64_data: 3
    name: "trip_count"
  }
  initializer {
    dims: 1
    data_type: 9
    int32_data: 1
    name: "cond_init"
  }
  input {
    name: "a_init"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  output {
    name: "a_final"
    type {
      tensor_type {
        elem_type: 1
      }
    }
  }
}
opset_import {
  version: 13
}
