ir_version: 7
graph {
  node {
    input: "seq_a"
    input: "seq_b"
    output: "seq"
    op_type: "SequenceConstruct"
  }
  node {
    input: "seq"
    output: "len"
    op_type: "SequenceLength"
  }
  node {
    input: "cond"
    output: "if_out"
    op_type: "If"
    attribute {
      name: "else_branch"
      g {
        node {
          output: "else_val"
          op_type: "Constant"
          attribute {
            name: "value"
            t {
              data_type: 1
              float_data: 0
              name: "else_val"
            }
            type: TENSOR
          }
        }
        name: "else_body"
        output {
          name: "else_val"
          type {
            tensor_type {
              elem_type: 1
              shape {
              }
            }
          }
        }
      }
      type: GRAPH
    }
    attribute {
      name: "then_branch"
      g {
        node {
          output: "then_val"
          op_type: "Constant"
          attribute {
            name: "value"
            t {
              dims: 2
              data_type: 1
              float_data: 1
              float_data: 2
              name: "then_val"
            }
            type: TENSOR
          }
        }
        name: "then_body"
        output {
          name: "then_val"
          type {
            tensor_type {
              elem_type: 1
              shape {
                dim {
                  dim_value: 2
                }
              }
            }
          }
        }
      }
      type: GRAPH
    }
  }
  name: "sal_if_rank_mismatch_repair"
  input {
    name: "cond"
    type {
      tensor_type {
        elem_type: 9
        shape {
        }
      }
    }
  }
  input {
    name: "seq_a"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "seq_b"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "if_out"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
          }
        }
      }
    }
  }
  output {
    name: "len"
    type {
      tensor_type {
        elem_type: 7
        shape {
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 15
}
