ir_version: 7
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "x"
    input: "out_shape"
    output: "y"
    op_type: "adaptive_avg_pool2d"
    domain: "org.pytorch.aten"
  }
  name: "test_adaptive_avg_pool2d"
  initializer {
    dims: 1
    data_type: 7
    int64_data: 2
    name: "out_shape"
  }
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  domain: "com.microsoft"
  version: 1
}
