ir_version: 7
producer_name: "test_data_generator"
graph {
  node {
    input: "in1"
    output: "relu1"
    op_type: "Relu"
    name: "relu1_name"
  }
  node {
    input: "relu1"
    input: "in2"
    output: "add1"
    op_type: "Add"
    name: "add_ambiguous_name"
  }
  node {
    input: "in3"
    input: "in4"
    output: "conv1"
    op_type: "Conv"
  }
  node {
    input: "relu1"
    input: "add1"
    output: "add2"
    op_type: "Add"
    name: "add_ambiguous_name"
  }
  node {
    input: "add1"
    input: "conv1"
    output: "mul2"
    op_type: "Mul"
    name: ""
  }
  node {
    input: "add2"
    output: "split1"
    output: "split2"
    op_type: "Split"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
    name: "split_name"
  }
  node {
    input: "relu1"
    input: "split1"
    output: "mul1"
    op_type: "Mul"
  }
  name: "subgraph_extraction_testing"
  initializer {
    dims: 1
    dims: 1
    dims: 1
    dims: 1
    data_type: 1
    float_data: 1
    name: "in4"
  }
  input {
    name: "in1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "in2"
    type {
      tensor_type {
        elem_type: 1
        shape {
        }
      }
    }
  }
  input {
    name: "in3"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "in4"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  output {
    name: "mul1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "split2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  output {
    name: "mul2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  version: 13
}
