ir_version: 6
producer_name: "nGraph ONNX Importer"
graph {
  node {
    input: "in1"
    input: "in2"
    output: "greater_or_equal_out"
    op_type: "GreaterOrEqual"
  }
  node {
    input: "greater_or_equal_out"
    output: "cast_out"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 6
      type: INT
    }
  }
  node {
    input: "cast_out"
    output: "y"
    output: "y_scale"
    output: "y_zero_point"
    op_type: "DynamicQuantizeLinear"
  }
  node {
    input: "y"
    output: "abs_y"
    op_type: "Abs"
  }
  input {
    name: "in1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "in2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  output {
    name: "abs_y"
    type {
      tensor_type {
        elem_type: 6
      }
    }
  }
  output {
    name: "y_scale"
    type {
      tensor_type {
        elem_type: 1
      }
    }
  }
  output {
    name: "y_zero_point"
    type {
      tensor_type {
        elem_type: 6
      }
    }
  }
}
opset_import {
  version: 12
}
