ir_version: 3
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "A"
    input: "B"
    output: "Y"
    name: "add"
    op_type: "Add"
  }
  name: "test_graph"
  initializer {
    dims: 2
    dims: 2
    data_type: 1
    name: "A"
    external_data {
        key: "location",
        value: "not_existed_file.data"
    }
    external_data {
        key: "offset",
        value: "4096"
    }
    external_data {
        key: "length",
        value: "16"
    }
    data_location: 1
  }
  input {
    name: "A"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "B"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  version: 4
}
