ir_version: 3
producer_name: "nGraph ONNX Importer"
graph {
  node {
    output: "B"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        dims: 2
        data_type: 1
        name: "const_tensor"
        external_data {
            key: "location",
            value: "tensors_data/tensor.data"
        }
        external_data {
            key: "length",
            value: "30000000000"
        }
        data_location: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "A"
    input: "B"
    output: "X"
    name: "add_node1"
    op_type: "Add"
  }
  name: "test_graph"
  input {
    name: "A"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "X"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  version: 4
}
