ir_version: 3
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "data_a"
    input: "data_b"
    input: "data_c"
    output: "result"
    op_type: "Mean"
  }
  name: "test_mean_example"
  initializer {
    dims: 1
    data_type: 1
    name: "data_a"
    external_data {
        key: "location",
        value: "tensors_data/a/tensor_a.data"
    }
    data_location: 1
  }
  initializer {
    dims: 3
    data_type: 1
    name: "data_b"
    external_data {
        key: "location",
        value: "tensors_data/b/tensor_b.data"
    }
    data_location: 1
  }
  input {
    name: "data_a"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "data_b"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "data_c"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "result"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
}
opset_import {
  version: 8
}
