ir_version: 6
producer_name: "nGraph ONNX Importer"
graph {
  node {
    input: "in1"
    input: "in2"
    output: "Func_GreaterOrEqual0x5601898ec4f0O1"
    op_type: "Greater"
  }
  node {
    input: "in1"
    input: "in2"
    output: "Func_GreaterOrEqual0x5601898ec4f0O2"
    op_type: "Equal"
  }
  node {
    input: "Func_GreaterOrEqual0x5601898ec4f0O1"
    input: "Func_GreaterOrEqual0x5601898ec4f0O2"
    output: "greater_or_equal_out"
    op_type: "Or"
  }
  node {
    input: "greater_or_equal_out"
    output: "cast_out"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 6
      type: INT
    }
  }
  node {
    output: "Func_DynamicQuantizeLinear0x560189b38280Q_Min"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        float_data: 0
      }
      type: TENSOR
    }
  }
  node {
    output: "Func_DynamicQuantizeLinear0x560189b38280Q_Max"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        float_data: 255
      }
      type: TENSOR
    }
  }
  node {
    input: "cast_out"
    output: "Func_DynamicQuantizeLinear0x560189b38280X_Min"
    op_type: "ReduceMin"
    attribute {
      name: "keepdims"
      i: 0
      type: INT
    }
  }
  node {
    input: "Func_DynamicQuantizeLinear0x560189b38280X_Min"
    input: "Func_DynamicQuantizeLinear0x560189b38280Q_Min"
    output: "Func_DynamicQuantizeLinear0x560189b38280X_Min_Adjusted"
    op_type: "Min"
  }
  node {
    input: "cast_out"
    output: "Func_DynamicQuantizeLinear0x560189b38280X_Max"
    op_type: "ReduceMax"
    attribute {
      name: "keepdims"
      i: 0
      type: INT
    }
  }
  node {
    input: "Func_DynamicQuantizeLinear0x560189b38280X_Max"
    input: "Func_DynamicQuantizeLinear0x560189b38280Q_Min"
    output: "Func_DynamicQuantizeLinear0x560189b38280X_Max_Adjusted"
    op_type: "Max"
  }
  node {
    input: "Func_DynamicQuantizeLinear0x560189b38280X_Max_Adjusted"
    input: "Func_DynamicQuantizeLinear0x560189b38280X_Min_Adjusted"
    output: "Func_DynamicQuantizeLinear0x560189b38280X_Range"
    op_type: "Sub"
  }
  node {
    input: "Func_DynamicQuantizeLinear0x560189b38280X_Range"
    input: "Func_DynamicQuantizeLinear0x560189b38280Q_Max"
    output: "Func_DynamicQuantizeLinear0x560189b38280Scale"
    op_type: "Div"
  }
  node {
    input: "Func_DynamicQuantizeLinear0x560189b38280X_Min_Adjusted"
    input: "Func_DynamicQuantizeLinear0x560189b38280Scale"
    output: "Func_DynamicQuantizeLinear0x560189b38280Min_Scaled"
    op_type: "Div"
  }
  node {
    input: "Func_DynamicQuantizeLinear0x560189b38280Q_Min"
    input: "Func_DynamicQuantizeLinear0x560189b38280Min_Scaled"
    output: "Func_DynamicQuantizeLinear0x560189b38280Initial_ZeroPoint_FP"
    op_type: "Sub"
  }
  node {
    input: "Func_DynamicQuantizeLinear0x560189b38280Initial_ZeroPoint_FP"
    input: "Func_DynamicQuantizeLinear0x560189b38280Q_Min"
    input: "Func_DynamicQuantizeLinear0x560189b38280Q_Max"
    output: "Func_DynamicQuantizeLinear0x560189b38280Clipped_ZeroPoint_FP"
    op_type: "Clip"
  }
  node {
    input: "Func_DynamicQuantizeLinear0x560189b38280Clipped_ZeroPoint_FP"
    output: "Func_DynamicQuantizeLinear0x560189b38280Rounded_ZeroPoint_FP"
    op_type: "Round"
  }
  node {
    input: "Func_DynamicQuantizeLinear0x560189b38280Rounded_ZeroPoint_FP"
    output: "Func_DynamicQuantizeLinear0x560189b38280Zeropoint"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 2
      type: INT
    }
  }
  node {
    input: "Func_DynamicQuantizeLinear0x560189b38280Scale"
    output: "y_scale"
    op_type: "Identity"
  }
  node {
    input: "Func_DynamicQuantizeLinear0x560189b38280Zeropoint"
    output: "y_zero_point"
    op_type: "Identity"
  }
  node {
    input: "cast_out"
    input: "Func_DynamicQuantizeLinear0x560189b38280Scale"
    input: "Func_DynamicQuantizeLinear0x560189b38280Zeropoint"
    output: "y"
    op_type: "QuantizeLinear"
  }
  node {
    input: "y"
    output: "abs_y"
    op_type: "Abs"
  }
  input {
    name: "in1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "in2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  output {
    name: "abs_y"
    type {
      tensor_type {
        elem_type: 6
      }
    }
  }
  output {
    name: "y_scale"
    type {
      tensor_type {
        elem_type: 1
      }
    }
  }
  output {
    name: "y_zero_point"
    type {
      tensor_type {
        elem_type: 6
      }
    }
  }
}
opset_import {
  version: 12
}
