ir_version: 7
producer_name: "onnx-importer-test"
graph {
  node {
    input: "in1"
    input: "in2"
    output: "out1"
    op_type: "ExperimentalDetectronTopKROIs"
    domain: "org.openvinotoolkit"
    attribute {
      name: "max_rois"
      i: 1000
      type: INT
    }
  }
  name: "test-model"
}
opset_import {
  domain: ""
  version: 10
}
opset_import {
  domain: "org.openvinotoolkit"
  version: 1
}
