ir_version: 3
producer_name: "OV ONNX FE"
graph {
  node {
    input: "A"
    input: "B"
    output: "X"
    op_type: "UnsupportedAdd"
  }
  node {
    input: "X"
    input: "C"
    output: "Y"
    op_type: "Add"
  }
  node {
    input: "Y"
    output: "Y_out"
    op_type: "UnsupportedAbs"
  }
  name: "test_graph"
  input {
    name: "A"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "B"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  input {
    name: "C"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
  output {
    name: "Y_out"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
}
opset_import {
  version: 4
}
