ir_version: 7
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "data"
    input: "gamma"
    input: "beta"
    output: "out1"
    op_type: "ExperimentalDetectronGroupNorm"
    domain: "org.openvinotoolkit"
    attribute {
        name: "num_groups"
        i: 4
        type: INT
    }
    attribute {
        name: "eps"
        f: 1e-6
        type: FLOAT
    }
  }
  initializer {
    dims: 8
    data_type: 1
    name: "gamma"
    raw_data: "\0\0\200?\0\0\0@\0\0@@\0\0\200@\0\0\240@\0\0\300@\0\0\340@\0\0\0A"
  }
  initializer {
    dims: 8
    data_type: 1
    name: "beta"
    raw_data: "\0\0\200?\0\0\0@\0\0@@\0\0\200@\0\0\240@\0\0\300@\0\0\340@\0\0\0A"
  }
  name: "test-model"
  input {
    name: "rois"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 16
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "data"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 8
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "out1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 8
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 10
}
