ir_version: 7
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "in1"
    input: "in2"
    input: "in3"
    output: "out1"
    op_type: "ExperimentalDetectronPriorGridGenerator"
    domain: "org.openvinotoolkit"
    attribute {
      name: "flatten"
      i: 1
      type: INT
    }
    attribute {
      name: "h"
      i: 0
      type: INT
    }
    attribute {
      name: "stride_x"
      f: 4
      type: FLOAT
    }
    attribute {
      name: "stride_y"
      f: 4
      type: FLOAT
    }
    attribute {
      name: "w"
      i: 0
      type: INT
    }
  }
  input {
    name: "in1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "in2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "in3"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
          dim {
            dim_value: 7
          }
        }
      }
    }
  }
  output {
    name: "out1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 9
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  name: "test-model"
}
opset_import {
  domain: ""
  version: 10
}
opset_import {
  domain: "org.openvinotoolkit"
  version: 1
}
