ir_version: 7
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "in1"
    input: "in2"
    output: "out1"
    op_type: "ExperimentalDetectronTopKROIs"
    domain: "org.openvinotoolkit"
    attribute {
      name: "max_rois"
      i: 1
      type: INT
    }
  }
  input {
    name: "in1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "in2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "out1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  name: "test-model"
}
opset_import {
  domain: ""
  version: 10
}
opset_import {
  domain: "org.openvinotoolkit"
  version: 1
}
