ir_version: 7
producer_name: "OpenVINO ONNX Frontend"
graph {
  name: "No name"
  node {
    input: "X"
    output: "X2"
    name: ""
    op_type: "Relu"
  }
  node {
    input: "X2"
    output: "Y"
    name: ""
    op_type: "MaxPool"
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
  }

  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 0
      }
    }
  }

  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 55
          }
          dim {
            dim_value: 55
          }
        }
      }
    }
  }
}

opset_import {
  version: 13
}
