ir_version: 7
producer_name: "onnx-importer-test"
graph {
  node {
    input: "im_info"
    input: "anchors"
    input: "deltas"
    input: "scores"
    output: "out1"
    output: "out2"
    op_type: "ExperimentalDetectronGenerateProposalsSingleImage"
    domain: "org.openvinotoolkit"
    attribute {
      name: "min_size"
      f: 0
      type: FLOAT
    }
    attribute {
      name: "nms_threshold"
      f: 0.69999998807907104
      type: FLOAT
    }
    attribute {
      name: "post_nms_count"
      i: 6
      type: INT
    }
    attribute {
      name: "pre_nms_count"
      i: 1000
      type: INT
    }
  }
  name: "test-model"
  input {
    name: "im_info"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  input {
    name: "anchors"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 36
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  input {
    name: "deltas"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 12
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 6
          }
        }
      }
    }
  }
  input {
    name: "scores"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 6
          }
        }
      }
    }
  }
  output {
    name: "out1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 6
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "out2"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 6
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 10
}
opset_import {
  domain: "org.openvinotoolkit"
  version: 1
}
