ir_version: 7
producer_name: "nGraph ONNX Importer"
graph {
  node {
    output: "Func_SoftmaxCrossEntropyLoss0x557617acabe0axes"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        int64_data: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "x"
    output: "Func_SoftmaxCrossEntropyLoss0x557617acabe0X_Max"
    op_type: "ReduceMax"
    attribute {
      name: "axes"
      ints: 1
      type: INTS
    }
  }
  node {
    input: "x"
    input: "Func_SoftmaxCrossEntropyLoss0x557617acabe0X_Max"
    output: "Func_SoftmaxCrossEntropyLoss0x557617acabe0X_Sub"
    op_type: "Sub"
  }
  node {
    input: "Func_SoftmaxCrossEntropyLoss0x557617acabe0X_Sub"
    output: "Func_SoftmaxCrossEntropyLoss0x557617acabe0X_Exp"
    op_type: "Exp"
  }
  node {
    input: "Func_SoftmaxCrossEntropyLoss0x557617acabe0X_Exp"
    input: "Func_SoftmaxCrossEntropyLoss0x557617acabe0axes"
    output: "Func_SoftmaxCrossEntropyLoss0x557617acabe0X_RS"
    op_type: "ReduceSum"
  }
  node {
    input: "Func_SoftmaxCrossEntropyLoss0x557617acabe0X_Exp"
    input: "Func_SoftmaxCrossEntropyLoss0x557617acabe0X_RS"
    output: "Func_SoftmaxCrossEntropyLoss0x557617acabe0X_Div"
    op_type: "Div"
  }
  node {
    input: "Func_SoftmaxCrossEntropyLoss0x557617acabe0X_Div"
    output: "Func_SoftmaxCrossEntropyLoss0x557617acabe0X_Log"
    op_type: "Log"
  }
  node {
    output: "Func_NegativeLogLikelihoodLoss0x557617d1bba0const_zero"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 6
        int32_data: 0
      }
      type: TENSOR
    }
  }
  node {
    output: "Func_NegativeLogLikelihoodLoss0x557617d1bba0const_one"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 6
        int32_data: 1
      }
      type: TENSOR
    }
  }
  node {
    output: "Func_NegativeLogLikelihoodLoss0x557617d1bba0axes"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        int64_data: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "y"
    input: "Func_NegativeLogLikelihoodLoss0x557617d1bba0axes"
    output: "Func_NegativeLogLikelihoodLoss0x557617d1bba0expanded_target"
    op_type: "Unsqueeze"
  }
  node {
    input: "Func_SoftmaxCrossEntropyLoss0x557617acabe0X_Log"
    input: "Func_NegativeLogLikelihoodLoss0x557617d1bba0expanded_target"
    output: "Func_NegativeLogLikelihoodLoss0x557617d1bba0input_gather_element"
    op_type: "GatherElements"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "Func_NegativeLogLikelihoodLoss0x557617d1bba0input_gather_element"
    output: "Func_NegativeLogLikelihoodLoss0x557617d1bba0loss_NCdd"
    op_type: "Neg"
  }
  node {
    input: "Func_NegativeLogLikelihoodLoss0x557617d1bba0loss_NCdd"
    input: "Func_NegativeLogLikelihoodLoss0x557617d1bba0const_zero"
    input: "Func_NegativeLogLikelihoodLoss0x557617d1bba0const_one"
    input: "Func_NegativeLogLikelihoodLoss0x557617d1bba0const_one"
    output: "Func_NegativeLogLikelihoodLoss0x557617d1bba0loss_N1dd"
    op_type: "Slice"
  }
  node {
    input: "Func_NegativeLogLikelihoodLoss0x557617d1bba0loss_N1dd"
    input: "Func_NegativeLogLikelihoodLoss0x557617d1bba0axes"
    output: "Func_NegativeLogLikelihoodLoss0x557617d1bba0loss_Ndd"
    op_type: "Squeeze"
  }
  node {
    input: "Func_NegativeLogLikelihoodLoss0x557617d1bba0loss_Ndd"
    output: "z"
    op_type: "ReduceMean"
    attribute {
      name: "keepdims"
      i: 0
      type: INT
    }
  }
  node {
    input: "z"
    output: "cast_out"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 6
      type: INT
    }
  }
  input {
    name: "x"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  input {
    name: "y"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 3
          }
        }
      }
    }
  }
  output {
    name: "cast_out"
    type {
      tensor_type {
        elem_type: 6
        shape {
        }
      }
    }
  }
}
opset_import {
  version: 13
}
