<?xml version="1.0" ?>
<net batch="1" name="mxnet_synthetic_gru_bidirectional_FP16_1_v6" version="6">
	<layers>
		<layer id="0" name="data" precision="FP16" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="hybridsequential0_gru0_swapaxes0" precision="FP16" type="Permute">
			<data order="1,0,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>10</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="hybridsequential0_gru0_hybridsequential0_gru0_h0_0/Output_0/Data__const" precision="FP16" type="Input">
			<output>
				<port id="1">
					<dim>2</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<custom offset="0" size="512"/>
			</blobs>
		</layer>
		<layer id="3" name="hybridsequential0_gru0_hybridsequential0_gru0_h0_0/Output_0/Data_/DecomposedBiLSTM_0" precision="FP16" type="Split">
			<data axis="0" num_split="2"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="141_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<custom offset="512" size="8"/>
			</blobs>
		</layer>
		<layer id="5" name="hybridsequential0_gru0_rnn0/Split/forward/HiddenStateResize" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="hybridsequential0_gru0_rnn0/Split/forward/TensorIterator" precision="FP16" type="TensorIterator">
			<input>
				<port id="0">
					<dim>10</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>10</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
			<port_map>
				<input axis="0" external_port_id="0" internal_layer_id="0" internal_port_id="0" part_size="1" stride="1"/>
				<input external_port_id="1" internal_layer_id="1" internal_port_id="1"/>
				<output axis="0" external_port_id="2" internal_layer_id="2" internal_port_id="1" part_size="1" stride="1"/>
				<output external_port_id="3" internal_layer_id="1" internal_port_id="4"/>
			</port_map>
			<back_edges>
				<edge from-layer="1" from-port="4" to-layer="1" to-port="1"/>
			</back_edges>
			<body>
				<layers>
					<layer id="0" name="hybridsequential0_gru0_rnn0/Split/forward/input_squeeze" precision="FP16" type="Reshape">
						<data dim="-1,16"/>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>1</dim>
								<dim>16</dim>
							</port>
						</input>
						<output>
							<port id="1">
								<dim>1</dim>
								<dim>16</dim>
							</port>
						</output>
					</layer>
					<layer id="1" name="hybridsequential0_gru0_rnn0/Split/forward/GRUCell" precision="FP16" type="GRUCell">
						<data hidden_size="128" linear_before_reset="1"/>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>16</dim>
							</port>
							<port id="1">
								<dim>1</dim>
								<dim>128</dim>
							</port>
						</input>
						<output>
							<port id="4">
								<dim>1</dim>
								<dim>128</dim>
							</port>
						</output>
						<blobs>
							<weights offset="560" size="110592"/>
							<biases offset="111152" size="1024"/>
						</blobs>
					</layer>
					<layer id="2" name="hybridsequential0_gru0_rnn0/Split/forward/output_unsqueeze/" precision="FP16" type="Reshape">
						<data dim="1,-1,128"/>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>128</dim>
							</port>
						</input>
						<output>
							<port id="1">
								<dim>1</dim>
								<dim>1</dim>
								<dim>128</dim>
							</port>
						</output>
					</layer>
				</layers>
				<edges>
					<edge from-layer="0" from-port="1" to-layer="1" to-port="0"/>
					<edge from-layer="1" from-port="4" to-layer="2" to-port="0"/>
				</edges>
			</body>
		</layer>
		<layer id="7" name="138_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="520" size="12"/>
			</blobs>
		</layer>
		<layer id="8" name="hybridsequential0_gru0_rnn0/Split/forward/SqueezeNumDirections/1" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="127_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<custom offset="512" size="8"/>
			</blobs>
		</layer>
		<layer id="10" name="hybridsequential0_gru0_rnn0/Split/reverse/HiddenStateResize" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="hybridsequential0_gru0_rnn0/Split/reverse/TensorIterator" precision="FP16" type="TensorIterator">
			<input>
				<port id="0">
					<dim>10</dim>
					<dim>1</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>10</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
			<port_map>
				<input axis="0" end="0" external_port_id="0" internal_layer_id="0" internal_port_id="0" part_size="1" start="-1" stride="-1"/>
				<input external_port_id="1" internal_layer_id="1" internal_port_id="1"/>
				<output axis="0" end="0" external_port_id="2" internal_layer_id="2" internal_port_id="1" part_size="1" start="-1" stride="-1"/>
				<output external_port_id="3" internal_layer_id="1" internal_port_id="4"/>
			</port_map>
			<back_edges>
				<edge from-layer="1" from-port="4" to-layer="1" to-port="1"/>
			</back_edges>
			<body>
				<layers>
					<layer id="0" name="hybridsequential0_gru0_rnn0/Split/reverse/input_squeeze" precision="FP16" type="Reshape">
						<data dim="-1,16"/>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>1</dim>
								<dim>16</dim>
							</port>
						</input>
						<output>
							<port id="1">
								<dim>1</dim>
								<dim>16</dim>
							</port>
						</output>
					</layer>
					<layer id="1" name="hybridsequential0_gru0_rnn0/Split/reverse/GRUCell" precision="FP16" type="GRUCell">
						<data hidden_size="128" linear_before_reset="1"/>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>16</dim>
							</port>
							<port id="1">
								<dim>1</dim>
								<dim>128</dim>
							</port>
						</input>
						<output>
							<port id="4">
								<dim>1</dim>
								<dim>128</dim>
							</port>
						</output>
						<blobs>
							<weights offset="112176" size="110592"/>
							<biases offset="111152" size="1024"/>
						</blobs>
					</layer>
					<layer id="2" name="hybridsequential0_gru0_rnn0/Split/reverse/output_unsqueeze/" precision="FP16" type="Reshape">
						<data dim="1,-1,128"/>
						<input>
							<port id="0">
								<dim>1</dim>
								<dim>128</dim>
							</port>
						</input>
						<output>
							<port id="1">
								<dim>1</dim>
								<dim>1</dim>
								<dim>128</dim>
							</port>
						</output>
					</layer>
				</layers>
				<edges>
					<edge from-layer="0" from-port="1" to-layer="1" to-port="0"/>
					<edge from-layer="1" from-port="4" to-layer="2" to-port="0"/>
				</edges>
			</body>
		</layer>
		<layer id="12" name="124_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="520" size="12"/>
			</blobs>
		</layer>
		<layer id="13" name="hybridsequential0_gru0_rnn0/Split/reverse/SqueezeNumDirections/1" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="hybridsequential0_gru0_rnn0/FinalConcat/HiddenState" precision="FP16" type="Concat">
			<data axis="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>2</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="134_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="532" size="16"/>
			</blobs>
		</layer>
		<layer id="16" name="hybridsequential0_gru0_rnn0/Split/forward/SqueezeNumDirections/0" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>10</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>10</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="120_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>4</dim>
				</port>
			</output>
			<blobs>
				<custom offset="532" size="16"/>
			</blobs>
		</layer>
		<layer id="18" name="hybridsequential0_gru0_rnn0/Split/reverse/SqueezeNumDirections/0" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>10</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>10</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="hybridsequential0_gru0_rnn0/FinalConcat/Data" precision="FP16" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>10</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>10</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>10</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="hybridsequential0_gru0_rnn0/Transpose_mxnet/" precision="FP16" type="Permute">
			<data order="0,2,1,3"/>
			<input>
				<port id="0">
					<dim>10</dim>
					<dim>2</dim>
					<dim>1</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>10</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="97_const" precision="I32" type="Const">
			<output>
				<port id="1">
					<dim>3</dim>
				</port>
			</output>
			<blobs>
				<custom offset="548" size="12"/>
			</blobs>
		</layer>
		<layer id="22" name="hybridsequential0_gru0_rnn0/Reshape_mxnet/" precision="FP16" type="Reshape">
			<input>
				<port id="0">
					<dim>10</dim>
					<dim>1</dim>
					<dim>2</dim>
					<dim>128</dim>
				</port>
				<port id="1">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>10</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="hybridsequential0_gru0_swapaxes1" precision="FP16" type="Permute">
			<data order="1,0,2"/>
			<input>
				<port id="0">
					<dim>10</dim>
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>10</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="hybridsequential0_relu0_fwd" precision="FP16" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>10</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>10</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0"/>
		<edge from-layer="2" from-port="1" to-layer="3" to-port="0"/>
		<edge from-layer="3" from-port="1" to-layer="5" to-port="0"/>
		<edge from-layer="4" from-port="1" to-layer="5" to-port="1"/>
		<edge from-layer="1" from-port="1" to-layer="6" to-port="0"/>
		<edge from-layer="5" from-port="2" to-layer="6" to-port="1"/>
		<edge from-layer="6" from-port="3" to-layer="8" to-port="0"/>
		<edge from-layer="7" from-port="1" to-layer="8" to-port="1"/>
		<edge from-layer="3" from-port="2" to-layer="10" to-port="0"/>
		<edge from-layer="9" from-port="1" to-layer="10" to-port="1"/>
		<edge from-layer="1" from-port="1" to-layer="11" to-port="0"/>
		<edge from-layer="10" from-port="2" to-layer="11" to-port="1"/>
		<edge from-layer="11" from-port="3" to-layer="13" to-port="0"/>
		<edge from-layer="12" from-port="1" to-layer="13" to-port="1"/>
		<edge from-layer="8" from-port="2" to-layer="14" to-port="0"/>
		<edge from-layer="13" from-port="2" to-layer="14" to-port="1"/>
		<edge from-layer="6" from-port="2" to-layer="16" to-port="0"/>
		<edge from-layer="15" from-port="1" to-layer="16" to-port="1"/>
		<edge from-layer="11" from-port="2" to-layer="18" to-port="0"/>
		<edge from-layer="17" from-port="1" to-layer="18" to-port="1"/>
		<edge from-layer="16" from-port="2" to-layer="19" to-port="0"/>
		<edge from-layer="18" from-port="2" to-layer="19" to-port="1"/>
		<edge from-layer="19" from-port="2" to-layer="20" to-port="0"/>
		<edge from-layer="20" from-port="1" to-layer="22" to-port="0"/>
		<edge from-layer="21" from-port="1" to-layer="22" to-port="1"/>
		<edge from-layer="22" from-port="2" to-layer="23" to-port="0"/>
		<edge from-layer="23" from-port="1" to-layer="24" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="unknown version"/>
		<cli_parameters>
			<blobs_as_inputs value="False"/>
			<caffe_parser_path value="DIR"/>
			<data_type value="FP16"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_omitting_optional value="False"/>
			<disable_resnet_optimization value="False"/>
			<enable_concat_optimization value="False"/>
			<enable_flattening_nested_params value="False"/>
			<enable_ssd_gluoncv value="False"/>
			<extensions value="DIR"/>
			<framework value="mxnet"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_experimental_IR_V10 value="False"/>
			<input_model value="DIR/net.params-0000.params"/>
			<input_model_is_text value="False"/>
			<input_shape value="(1, 10, 16)"/>
			<k value="DIR/CustomLayersMapping.xml"/>
			<keep_quantize_ops_in_IR value="False"/>
			<keep_shape_ops value="False"/>
			<legacy_mxnet_model value="True"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<model_name value="mxnet_synthetic_gru_bidirectional_FP16_1_v6"/>
			<move_to_preprocess value="False"/>
			<output_dir value="DIR"/>
			<placeholder_shapes value="[ 1 10 16]"/>
			<remove_output_softmax value="False"/>
			<reverse_input_channels value="False"/>
			<save_params_from_nd value="False"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<version value="False"/>
			<unset unset_cli_parameters="batch, counts, disable_fusing, disable_gfusing, finegrain_fusing, generate_deprecated_IR_V2, input, input_checkpoint, input_meta_graph, input_proto, input_symbol, mean_file, mean_file_offsets, nd_prefix_name, output, pretrained_model_name, saved_model_dir, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_operation_patterns, tensorflow_subgraph_patterns, tensorflow_use_custom_operations_config"/>
		</cli_parameters>
	</meta_data>
</net>
