ir_version: 7
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    output: "input_low"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        dims: 1
        dims: 1
        dims: 1
        data_type: 1
        float_data: 3.0
        name: "const_tensor"
      }
      type: TENSOR
    }
  }
  node {
    output: "input_high"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        dims: 1
        dims: 1
        dims: 1
        data_type: 1
        float_data: 17.0
        name: "const_tensor"
      }
      type: TENSOR
    }
  }
  node {
    output: "output_low"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        dims: 1
        dims: 1
        dims: 1
        data_type: 1
        float_data: 2.0
        name: "const_tensor"
      }
      type: TENSOR
    }
  }
  node {
    output: "output_high"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        dims: 1
        dims: 1
        dims: 1
        data_type: 1
        float_data: 16.0
        name: "const_tensor"
      }
      type: TENSOR
    }
  }
  node {
    domain: "org.openvinotoolkit"
    input: "X"
    input: "input_low"
    input: "input_high"
    input: "output_low"
    input: "output_high"
    output: "Y"
    op_type: "FakeQuantize"
    attribute {
      name: "levels"
      i: 5
      type: INT
    }
  }
  name: "test-model"
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  domain: ""
  version: 9
}
