ir_version: 7
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "A"
    input: "B"
    output: "X"
    name: "add_node"
    op_type: "Add"
  }
  name: "test_graph"
  initializer {
    dims: 2
    data_type: 7
    int64_data: 1
    int64_data: 2
    name: "A"
  }
  initializer {
    dims: 2
    data_type: 7
    int64_data: 1
    int64_data: 2
    name: "B"
  }
  input {
    name: "A"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  input {
    name: "B"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
  output {
    name: "X"
    type {
      tensor_type {
        elem_type: 7
        shape {
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}
opset_import {
  version: 13
}
