ir_version: 7
producer_name: "OpenVINO ONNX Frontend"
doc_string: "This model contains the first few nodes of the ONNX Inception V1 model"
graph {
  name: "Inception V1 fragment"
  node {
    input: "data_0"
    input: "conv1/7x7_s2_w_0"
    input: "conv1/7x7_s2_b_0"
    output: "conv1/7x7_s2_1"
    name: "conv1"
    op_type: "Conv"
    attribute {
        name: "strides"
        ints: 2
        ints: 2
        type: INTS
    }
    attribute {
        name: "pads"
        ints: 3
        ints: 3
        ints: 3
        ints: 3
        type: INTS
    }
    attribute {
        name: "kernel_shape"
        ints: 7
        ints: 7
        type: INTS
    }
  }
  node {
    input: "conv1/7x7_s2_1"
    output: "conv1/7x7_s2_2"
    name: "relu1"
    op_type: "Relu"
  }
  node {
    input: "conv1/7x7_s2_2"
    output: "pool1/3x3_s2_1"
    name: "maxpool1"
    op_type: "MaxPool"
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
  }

  input {
    name: "data_0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 224
          }
          dim {
            dim_value: 224
          }
        }
      }
    }
  }

  input {
    name: "conv1/7x7_s2_w_0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 7
          }
          dim {
            dim_value: 7
          }
        }
      }
    }
  }

  input {
    name: "conv1/7x7_s2_b_0"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 64
          }
        }
      }
    }
  }

  output {
    name: "pool1/3x3_s2_1"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 64
          }
          dim {
            dim_value: 55
          }
          dim {
            dim_value: 55
          }
        }
      }
    }
  }
}

opset_import {
  version: 13
}
