<?xml version="1.0"?>
<net name="Model0" version="11">
	<layers>
		<layer id="0" name="Constant_1" type="Const" version="opset1">
			<data element_type="string" shape="2, 3" offset="0" size="60" />
			<output>
				<port id="0" precision="STRING">
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Result_2" type="Result" version="opset1">
			<input>
				<port id="0" precision="STRING">
					<dim>2</dim>
					<dim>3</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0" />
	</edges>
	<rt_info />
</net>
