ir_version: 10
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "query"
    input: "key"
    input: "value"
    input: ""
    input: ""
    input: ""
    input: "past_key"
    input: "past_value"
    input: "past_sequence_length"
    output: "output"
    output: "present_key"
    output: "present_value"
    name: "MultiHeadAttention_15_cache_buffer_sharing"
    op_type: "MultiHeadAttention"
    attribute {
      name: "num_heads"
      i: 2
      type: INT
    }
    domain: "com.microsoft"
  }
  name: "multi_head_attention_15_cache_buffer_sharing"
  input {
    name: "query"
    type { tensor_type { elem_type: 1
      shape { dim { dim_value: 1 } dim { dim_value: 1 } dim { dim_value: 6 } } } }
  }
  input {
    name: "key"
    type { tensor_type { elem_type: 1
      shape { dim { dim_value: 1 } dim { dim_value: 1 } dim { dim_value: 6 } } } }
  }
  input {
    name: "value"
    type { tensor_type { elem_type: 1
      shape { dim { dim_value: 1 } dim { dim_value: 1 } dim { dim_value: 6 } } } }
  }
  input {
    name: "past_key"
    type { tensor_type { elem_type: 1
      shape { dim { dim_value: 1 } dim { dim_value: 2 } dim { dim_value: 8 } dim { dim_value: 3 } } } }
  }
  input {
    name: "past_value"
    type { tensor_type { elem_type: 1
      shape { dim { dim_value: 1 } dim { dim_value: 2 } dim { dim_value: 8 } dim { dim_value: 3 } } } }
  }
  input {
    name: "past_sequence_length"
    type { tensor_type { elem_type: 6
      shape { dim { dim_value: 1 } } } }
  }
  output {
    name: "output"
    type { tensor_type { elem_type: 1
      shape { dim { dim_value: 1 } dim { dim_value: 1 } dim { dim_value: 6 } } } }
  }
  output {
    name: "present_key"
    type { tensor_type { elem_type: 1
      shape { dim { dim_value: 1 } dim { dim_value: 2 } dim { dim_value: 8 } dim { dim_value: 3 } } } }
  }
  output {
    name: "present_value"
    type { tensor_type { elem_type: 1
      shape { dim { dim_value: 1 } dim { dim_value: 2 } dim { dim_value: 8 } dim { dim_value: 3 } } } }
  }
}
opset_import { version: 11 }
opset_import {
  domain: "com.microsoft"
  version: 1
}