ir_version: 3
producer_name: "OpenVINO ONNX Frontend"
producer_version: ""
model_version: 0
graph {
  name: "test_qlinear_leakyrelu"
  
  node {
    input: "X"
    input: "X_scale"
    input: "X_zero_point"
    input: "Y_scale"
    input: "Y_zero_point"
    output: "Y"
    op_type: "QLinearLeakyRelu"
    attribute {
     name: "alpha"
     f: 0.1
     type: FLOAT
    }
    domain: "com.microsoft"
  }

  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 3 
        shape {
          dim { dim_value: 2 }
          dim { dim_value: 3 }
        }
      }
    }
  }

  input {
    name: "X_scale"
    type {
      tensor_type {
        elem_type: 1  # float
        shape {
          dim { dim_value: 1 }
        }
      }
    }
  }

  input {
    name: "X_zero_point"
    type {
      tensor_type {
        elem_type: 3
        shape {
          dim { dim_value: 1 }
        }
      }
    }
  }

  input {
    name: "Y_scale"
    type {
      tensor_type {
        elem_type: 1 
        shape {
          dim { dim_value: 1 }
        }
      }
    }
  }

  input {
    name: "Y_zero_point"
    type {
      tensor_type {
        elem_type: 3
        shape {
          dim { dim_value: 1 }
        }
      }
    }
  }

  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 3 
        shape {
          dim { dim_value: 2 }
          dim { dim_value: 3 }
        }
      }
    }
  }
}

opset_import {
  version: 1
}
