ir_version: 3
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "X"
    input: "x_scale"
    input: "x_zero_point"
    input: "y_scale"
    input: "y_zero_point"
    output: "Y"
    name: "test_Qlinear_global_avg_pool_with_channels_last"
    domain: "com.microsoft"
    op_type: "QLinearGlobalAveragePool"
    attribute {
      name: "channels_last"
      i: 1
      type: INT
    }
  }

  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 2
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }

   input {
    name: "x_scale"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim { dim_value: 1 }
        }
      }
    }
  }

  input {
    name: "x_zero_point"
    type {
      tensor_type {
        elem_type: 2
        shape {
          dim { dim_value: 1 }
        }
      }
    }
  }

  input {
    name: "y_scale"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim { dim_value: 1 }
        }
      }
    }
  }

  input {
    name: "y_zero_point"
    type {
      tensor_type {
        elem_type: 2
        shape {
          dim { dim_value: 1 }
        }
      }
    }
  }

  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 2
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 2
          }
        }
      }
    }
  }
}

opset_import {
   domain: "com.microsoft"
   version: 1
}
