ir_version: 3
producer_name: "OpenVINO ONNX Frontend"
producer_version: ""
model_version: 0
graph {
  name: "qlinear_concat_invalid_x_input_triplet"

  node {
    input: "Y_scale"
    input: "Y_zero_point"
    input: "X1"
    input: "X1_scale"
    input: "X1_zero_point"
    input: "X2"
    output: "Y"
    op_type: "QLinearConcat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
    domain: "com.microsoft"
  }

  input {
    name: "Y_scale"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim { dim_value: 1 }
        }
      }
    }
  }

  input {
    name: "Y_zero_point"
    type {
      tensor_type {
        elem_type: 2
        shape {
          dim { dim_value: 1 }
        }
      }
    }
  }

  input {
    name: "X1"
    type {
      tensor_type {
        elem_type: 2
        shape {
          dim { dim_value: 4 }
        }
      }
    }
  }

  input {
    name: "X1_scale"
    type {
      tensor_type {
        elem_type: 2
        shape {
          dim { dim_value: 4 }
        }
      }
    }
  }

  input {
    name: "X1_zero_point"
    type {
      tensor_type {
        elem_type: 2
        shape {
          dim { dim_value: 4 }
        }
      }
    }
  }

  input {
    name: "X2"
    type {
      tensor_type {
        elem_type: 2
        shape {
          dim { dim_value: 4 }
        }
      }
    }
  }

  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 2
        shape {
          dim { dim_value: 4 }
        }
      }
    }
  }
}
opset_import {
  domain: "com.microsoft"
  version: 1
}
