ir_version: 3
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "A"
    input: "A_scale"
    input: "A_zero"
    input: "B_scale"
    input: "B_zero"
    output: "R"
    name: "test_Qlinear_avg_pool"
    domain: "com.microsoft"
    op_type: "QLinearAveragePool"
    attribute {
      name: "auto_pad"
      s: "NOTSET"
      type: STRING
    }
    attribute {
      name: "ceil_mode"
      i: 0
      type: INT
    }
    attribute {
      name: "count_include_pad"
      i: 0
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 7
      ints: 7
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }

  initializer {
    data_type: 1
    float_data: 0.023529412
    name: "A_scale"
  }

 initializer {
    data_type: 2
    int32_data: 0
    name: "A_zero"
  }

  initializer {
    data_type: 1
    float_data: 0.01812745
    name: "B_scale"
  }

  initializer {
    data_type: 2
    int32_data: 0
    name: "B_zero"
  }


   input {
    name: "A"
    type {
      tensor_type {
        elem_type: 2
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 7
          }
          dim {
            dim_value: 7
          }
        }
      }
    }
  }
  
    output {
    name: "R"
    type {
      tensor_type {
        elem_type: 2
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
        }
      }
    }
  }
}
opset_import {
   domain: "com.microsoft"
  version: 1
}