ir_version: 3
producer_name: "OpenVINO ONNX Frontend"
producer_version: ""
model_version: 0
graph {
  name: "test_qlinear_concat_i8"

  node {
    input: "Y_scale"
    input: "Y_zero_point"
    input: "X1"
    input: "X1_scale"
    input: "X1_zero_point"
    input: "X2"
    input: "X2_scale"
    input: "X2_zero_point"
    output: "Y"
    op_type: "QLinearConcat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
    domain: "com.microsoft"
  }

  input {
    name: "Y_scale"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim { dim_value: 1 }
        }
      }
    }
  }

  input {
    name: "Y_zero_point"
    type {
      tensor_type {
        elem_type: 3
        shape {
          dim { dim_value: 1 }
        }
      }
    }
  }

  input {
    name: "X1"
    type {
      tensor_type {
        elem_type: 3
        shape {
          dim { dim_value: 2 }
          dim { dim_value: 2 }
        }
      }
    }
  }

  input {
    name: "X1_scale"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim { dim_value: 1 }
        }
      }
    }
  }

  input {
    name: "X1_zero_point"
    type {
      tensor_type {
        elem_type: 3
        shape {
          dim { dim_value: 1 }
        }
      }
    }
  }

  input {
    name: "X2"
    type {
      tensor_type {
        elem_type: 3
        shape {
          dim { dim_value: 2 }
          dim { dim_value: 2 }
        }
      }
    }
  }

  input {
    name: "X2_scale"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim { dim_value: 1 }
        }
      }
    }
  }

  input {
    name: "X2_zero_point"
    type {
      tensor_type {
        elem_type: 3
        shape {
          dim { dim_value: 1 }
        }
      }
    }
  }

  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 3
        shape {
          dim { dim_value: 2 }
          dim { dim_value: 4 }
        }
      }
    }
  }
}

opset_import {
  version: 1
}
