ir_version: 3
producer_name: "OpenVINO ONNX Frontend"
graph {
  name: "test_quick_gelu"
  node {
    input: "X"
    output: "Y"
    op_type: "QuickGelu"
    attribute {
      name: "alpha"
      f: 0.9974269270896912
      type: FLOAT
    }
    domain: "com.microsoft"
  }
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 2
          }
          dim {
            dim_value: 5
          }
        }
      }
    }
  }
}
opset_import {
  domain: "com.microsoft"
  version: 1
}