ir_version: 6
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "start"
    input: "limit"
    input: "delta"
    output: "output"
    op_type: "Range"
    domain: "com.microsoft"
  }
  name: "test_range_float_type_with_delta"
  input {
    name: "start"
    type {
      tensor_type {
        elem_type: 1
        shape {
        }
      }
    }
  }
  input {
    name: "limit"
    type {
      tensor_type {
        elem_type: 1
        shape {
        }
      }
    }
  }
  input {
    name: "delta"
    type {
      tensor_type {
        elem_type: 1
        shape {
        }
      }
    }
  }
  output {
    name: "output"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 10
          }
        }
      }
    }
  }
}
opset_import {
  version: 1
  domain: "com.microsoft"
}
