ir_version: 3
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "A"
    input: "B"
    output: "O"
    name: "test_LayerNorm"
    op_type: "SimplifiedLayerNormalization"
    attribute {
      name: "epsilon"
      f: 1e-05
      type: FLOAT
    }
    attribute {
      name: "axis"
      i: -1
      type: INT
    }
    attribute {
      name: "stash_type"
      i: 1
      type: INT
    }
  }
  name: "compute_graph"
  initializer {
      dims: 8
      data_type: 1
      name: "B"
      raw_data: "\x00\x00\x80\x3f\x00\x00\x80\x3f\x00\x00\x80\x3f\x00\x00\x80\x3f\x00\x00\x80\x3f\x00\x00\x80\x3f\x00\x00\x80\x3f\x00\x00\x80\x3f"  }
  input {
    name: "A"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 32064
          }
          dim {
            dim_value: 8
          }
                  }
      }
    }
  }
  output {
    name: "O"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 1
          }
          dim {
            dim_value: 8
          }

        }
      }
    }
  }
}
opset_import {
  domain: "com.microsoft"
  version: 1
}