ir_version: 7
producer_name: "OpenVINO ONNX Frontend"
graph {
  node {
    input: "X"
    output: "Y"
    name: "Normalizer_L2"
    op_type: "Normalizer"
    attribute {
      name: "norm"
      s: "L2"
      type: STRING
    }
    domain: "ai.onnx.ml"
  }
  name: "normalizer_l2_graph"
  input {
    name: "X"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
  output {
    name: "Y"
    type {
      tensor_type {
        elem_type: 1
        shape {
          dim {
            dim_value: 3
          }
          dim {
            dim_value: 4
          }
        }
      }
    }
  }
}
opset_import {
  version: 15
}
opset_import {
  domain: "ai.onnx.ml"
  version: 3
}
