<?xml version="1.0"?>
<net name="Function_0" version="10">
	<layers>
		<layer id="0" name="x" type="Parameter" version="opset1">
			<data shape="2, 30, 4, 4" element_type="f32" />
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>30</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="2" name="split_0.tmp_0" type="Split" version="opset1">
			<data num_splits="30" />
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>30</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1" />
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="3" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="4" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="5" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="6" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="7" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="8" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="9" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="10" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="11" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="12" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="13" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="14" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="15" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="16" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="17" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="18" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="19" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="20" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="21" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="22" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="23" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="24" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="25" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="26" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="27" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="28" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="29" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="30" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="31" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="elementwise_add_14.tmp_0" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_46" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="4" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="save_infer_model/scale_14.tmp_0" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="save_infer_model/scale_14.tmp_0/Result" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
		</layer>
		<layer id="7" name="elementwise_add_13.tmp_0" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Constant_44" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="4" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="save_infer_model/scale_13.tmp_0" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="save_infer_model/scale_13.tmp_0/Result" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
		</layer>
		<layer id="11" name="elementwise_add_12.tmp_0" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Constant_42" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="4" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="save_infer_model/scale_12.tmp_0" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="save_infer_model/scale_12.tmp_0/Result" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
		</layer>
		<layer id="15" name="elementwise_add_11.tmp_0" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Constant_40" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="4" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="save_infer_model/scale_11.tmp_0" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="save_infer_model/scale_11.tmp_0/Result" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
		</layer>
		<layer id="19" name="elementwise_add_10.tmp_0" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_38" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="4" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="save_infer_model/scale_10.tmp_0" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="save_infer_model/scale_10.tmp_0/Result" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
		</layer>
		<layer id="23" name="elementwise_add_9.tmp_0" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_36" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="4" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="save_infer_model/scale_9.tmp_0" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="save_infer_model/scale_9.tmp_0/Result" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
		</layer>
		<layer id="27" name="elementwise_add_8.tmp_0" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_34" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="4" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="save_infer_model/scale_8.tmp_0" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="save_infer_model/scale_8.tmp_0/Result" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
		</layer>
		<layer id="31" name="elementwise_add_7.tmp_0" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_32" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="4" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="save_infer_model/scale_7.tmp_0" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="save_infer_model/scale_7.tmp_0/Result" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
		</layer>
		<layer id="35" name="elementwise_add_6.tmp_0" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Constant_30" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="4" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="save_infer_model/scale_6.tmp_0" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="save_infer_model/scale_6.tmp_0/Result" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
		</layer>
		<layer id="39" name="elementwise_add_5.tmp_0" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_28" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="4" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="save_infer_model/scale_5.tmp_0" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="save_infer_model/scale_5.tmp_0/Result" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
		</layer>
		<layer id="43" name="elementwise_add_4.tmp_0" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Constant_26" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="4" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="save_infer_model/scale_4.tmp_0" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="save_infer_model/scale_4.tmp_0/Result" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
		</layer>
		<layer id="47" name="elementwise_add_3.tmp_0" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Constant_24" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="4" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="save_infer_model/scale_3.tmp_0" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="save_infer_model/scale_3.tmp_0/Result" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
		</layer>
		<layer id="51" name="elementwise_add_2.tmp_0" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_22" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="4" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="save_infer_model/scale_2.tmp_0" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="save_infer_model/scale_2.tmp_0/Result" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
		</layer>
		<layer id="55" name="elementwise_add_1.tmp_0" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_20" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="4" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="save_infer_model/scale_1.tmp_0" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="save_infer_model/scale_1.tmp_0/Result" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
		</layer>
		<layer id="59" name="elementwise_add_0.tmp_0" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Constant_18" type="Const" version="opset1">
			<data element_type="f32" shape="1" offset="4" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="save_infer_model/scale_0.tmp_0" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="save_infer_model/scale_0.tmp_0/Result" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>1</dim>
					<dim>4</dim>
					<dim>4</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="1" from-port="0" to-layer="2" to-port="1" />
		<edge from-layer="2" from-port="23" to-layer="19" to-port="1" />
		<edge from-layer="2" from-port="17" to-layer="31" to-port="1" />
		<edge from-layer="2" from-port="20" to-layer="23" to-port="0" />
		<edge from-layer="2" from-port="21" to-layer="23" to-port="1" />
		<edge from-layer="2" from-port="18" to-layer="27" to-port="0" />
		<edge from-layer="2" from-port="19" to-layer="27" to-port="1" />
		<edge from-layer="2" from-port="16" to-layer="31" to-port="0" />
		<edge from-layer="2" from-port="14" to-layer="35" to-port="0" />
		<edge from-layer="2" from-port="15" to-layer="35" to-port="1" />
		<edge from-layer="2" from-port="12" to-layer="39" to-port="0" />
		<edge from-layer="2" from-port="13" to-layer="39" to-port="1" />
		<edge from-layer="2" from-port="10" to-layer="43" to-port="0" />
		<edge from-layer="2" from-port="11" to-layer="43" to-port="1" />
		<edge from-layer="2" from-port="8" to-layer="47" to-port="0" />
		<edge from-layer="2" from-port="9" to-layer="47" to-port="1" />
		<edge from-layer="2" from-port="6" to-layer="51" to-port="0" />
		<edge from-layer="2" from-port="7" to-layer="51" to-port="1" />
		<edge from-layer="2" from-port="4" to-layer="55" to-port="0" />
		<edge from-layer="2" from-port="5" to-layer="55" to-port="1" />
		<edge from-layer="2" from-port="2" to-layer="59" to-port="0" />
		<edge from-layer="2" from-port="3" to-layer="59" to-port="1" />
		<edge from-layer="2" from-port="28" to-layer="7" to-port="0" />
		<edge from-layer="2" from-port="29" to-layer="7" to-port="1" />
		<edge from-layer="2" from-port="31" to-layer="3" to-port="1" />
		<edge from-layer="2" from-port="27" to-layer="11" to-port="1" />
		<edge from-layer="2" from-port="24" to-layer="15" to-port="0" />
		<edge from-layer="2" from-port="25" to-layer="15" to-port="1" />
		<edge from-layer="2" from-port="30" to-layer="3" to-port="0" />
		<edge from-layer="2" from-port="22" to-layer="19" to-port="0" />
		<edge from-layer="2" from-port="26" to-layer="11" to-port="0" />
		<edge from-layer="3" from-port="2" to-layer="5" to-port="0" />
		<edge from-layer="4" from-port="0" to-layer="5" to-port="1" />
		<edge from-layer="5" from-port="2" to-layer="6" to-port="0" />
		<edge from-layer="7" from-port="2" to-layer="9" to-port="0" />
		<edge from-layer="8" from-port="0" to-layer="9" to-port="1" />
		<edge from-layer="9" from-port="2" to-layer="10" to-port="0" />
		<edge from-layer="11" from-port="2" to-layer="13" to-port="0" />
		<edge from-layer="12" from-port="0" to-layer="13" to-port="1" />
		<edge from-layer="13" from-port="2" to-layer="14" to-port="0" />
		<edge from-layer="15" from-port="2" to-layer="17" to-port="0" />
		<edge from-layer="16" from-port="0" to-layer="17" to-port="1" />
		<edge from-layer="17" from-port="2" to-layer="18" to-port="0" />
		<edge from-layer="19" from-port="2" to-layer="21" to-port="0" />
		<edge from-layer="20" from-port="0" to-layer="21" to-port="1" />
		<edge from-layer="21" from-port="2" to-layer="22" to-port="0" />
		<edge from-layer="23" from-port="2" to-layer="25" to-port="0" />
		<edge from-layer="24" from-port="0" to-layer="25" to-port="1" />
		<edge from-layer="25" from-port="2" to-layer="26" to-port="0" />
		<edge from-layer="27" from-port="2" to-layer="29" to-port="0" />
		<edge from-layer="28" from-port="0" to-layer="29" to-port="1" />
		<edge from-layer="29" from-port="2" to-layer="30" to-port="0" />
		<edge from-layer="31" from-port="2" to-layer="33" to-port="0" />
		<edge from-layer="32" from-port="0" to-layer="33" to-port="1" />
		<edge from-layer="33" from-port="2" to-layer="34" to-port="0" />
		<edge from-layer="35" from-port="2" to-layer="37" to-port="0" />
		<edge from-layer="36" from-port="0" to-layer="37" to-port="1" />
		<edge from-layer="37" from-port="2" to-layer="38" to-port="0" />
		<edge from-layer="39" from-port="2" to-layer="41" to-port="0" />
		<edge from-layer="40" from-port="0" to-layer="41" to-port="1" />
		<edge from-layer="41" from-port="2" to-layer="42" to-port="0" />
		<edge from-layer="43" from-port="2" to-layer="45" to-port="0" />
		<edge from-layer="44" from-port="0" to-layer="45" to-port="1" />
		<edge from-layer="45" from-port="2" to-layer="46" to-port="0" />
		<edge from-layer="47" from-port="2" to-layer="49" to-port="0" />
		<edge from-layer="48" from-port="0" to-layer="49" to-port="1" />
		<edge from-layer="49" from-port="2" to-layer="50" to-port="0" />
		<edge from-layer="51" from-port="2" to-layer="53" to-port="0" />
		<edge from-layer="52" from-port="0" to-layer="53" to-port="1" />
		<edge from-layer="53" from-port="2" to-layer="54" to-port="0" />
		<edge from-layer="55" from-port="2" to-layer="57" to-port="0" />
		<edge from-layer="56" from-port="0" to-layer="57" to-port="1" />
		<edge from-layer="57" from-port="2" to-layer="58" to-port="0" />
		<edge from-layer="59" from-port="2" to-layer="61" to-port="0" />
		<edge from-layer="60" from-port="0" to-layer="61" to-port="1" />
		<edge from-layer="61" from-port="2" to-layer="62" to-port="0" />
	</edges>
</net>
